#![allow(warnings)]
/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl<T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
pub const _SYS_TIME_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;

pub const PROMPT_NOFORMAT: u32 = 8;
pub const KEY_BINDING_REPEAT: u32 = 1;
pub const OPTIONS_TABLE_IS_ARRAY: u32 = 1;
pub const CMD_TARGET_PANE_USAGE: &'static [u8; 17usize] = b"[-t target-pane]\0";
pub const CMD_TARGET_WINDOW_USAGE: &'static [u8; 19usize] = b"[-t target-window]\0";
pub const CMD_TARGET_SESSION_USAGE: &'static [u8; 20usize] = b"[-t target-session]\0";
pub const CMD_TARGET_CLIENT_USAGE: &'static [u8; 19usize] = b"[-t target-client]\0";
pub const CMD_SRCDST_PANE_USAGE: &'static [u8; 28usize] = b"[-s src-pane] [-t dst-pane]\0";
pub const CMD_SRCDST_WINDOW_USAGE: &'static [u8; 32usize] = b"[-s src-window] [-t dst-window]\0";
pub const CMD_SRCDST_SESSION_USAGE: &'static [u8; 34usize] = b"[-s src-session] [-t dst-session]\0";
pub const CMD_SRCDST_CLIENT_USAGE: &'static [u8; 32usize] = b"[-s src-client] [-t dst-client]\0";
pub const CMD_BUFFER_USAGE: &'static [u8; 17usize] = b"[-b buffer-name]\0";
pub const SPAWN_KILL: u32 = 1;
pub const SPAWN_DETACHED: u32 = 2;
pub const SPAWN_RESPAWN: u32 = 4;
pub const SPAWN_BEFORE: u32 = 8;
pub const SPAWN_NONOTIFY: u32 = 16;
pub const SPAWN_FULLSIZE: u32 = 32;
pub const FORMAT_STATUS: u32 = 1;
pub const FORMAT_FORCE: u32 = 2;
pub const FORMAT_NOJOBS: u32 = 4;
pub const FORMAT_VERBOSE: u32 = 8;
pub const FORMAT_NONE: u32 = 0;
pub const FORMAT_PANE: u32 = 2147483648;
pub const FORMAT_WINDOW: u32 = 1073741824;
pub const JOB_NOWAIT: u32 = 1;
pub const FORMAT_PLUGIN: u32 = 1;
pub const FORMAT_FUNCTION_PLUGIN: u32 = 2;
pub const CMD_PLUGIN: u32 = 3;
pub const NOTIFICATION_PLUGIN: u32 = 4;
pub const MULTI_PLUGIN: u32 = 5;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    assert_eq!(
        ::std::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timezone>())).tz_minuteswest as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timezone>())).tz_dsttime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
pub type __timezone_ptr_t = *mut timezone;
extern "C" {
    pub fn gettimeofday(__tv: *mut timeval, __tz: __timezone_ptr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ::std::os::raw::c_int;
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    assert_eq!(
        ::std::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerval>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerval>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
pub type __itimer_which_t = ::std::os::raw::c_int;
extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lutimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimes(__fd: ::std::os::raw::c_int, __tvp: *const timeval) -> ::std::os::raw::c_int;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
extern "C" {
    pub fn gnu_dev_major(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(
        __major: ::std::os::raw::c_uint,
        __minor: ::std::os::raw::c_uint,
    ) -> __dev_t;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iovec>())).iov_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iovec>())).iov_len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
extern "C" {
    pub fn readv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn writev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn preadv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pwritev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> isize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = u32;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).ss_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_padding as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_align as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
pub const MSG_OOB: _bindgen_ty_1 = 1;
pub const MSG_PEEK: _bindgen_ty_1 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_1 = 4;
pub const MSG_CTRUNC: _bindgen_ty_1 = 8;
pub const MSG_PROXY: _bindgen_ty_1 = 16;
pub const MSG_TRUNC: _bindgen_ty_1 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_1 = 64;
pub const MSG_EOR: _bindgen_ty_1 = 128;
pub const MSG_WAITALL: _bindgen_ty_1 = 256;
pub const MSG_FIN: _bindgen_ty_1 = 512;
pub const MSG_SYN: _bindgen_ty_1 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_1 = 2048;
pub const MSG_RST: _bindgen_ty_1 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = 16384;
pub const MSG_MORE: _bindgen_ty_1 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_1 = 65536;
pub const MSG_BATCH: _bindgen_ty_1 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_1 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_1 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = 1073741824;
pub type _bindgen_ty_1 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_namelen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iov as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iovlen as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_control as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_controllen as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
}
extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<linger>())).l_onoff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_onoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<linger>())).l_linger as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_linger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
pub const SHUT_RD: _bindgen_ty_3 = 0;
pub const SHUT_WR: _bindgen_ty_3 = 1;
pub const SHUT_RDWR: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = u32;
extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_ip_opts() {
    assert_eq!(
        ::std::mem::size_of::<ip_opts>(),
        44usize,
        concat!("Size of: ", stringify!(ip_opts))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_opts>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_opts))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_dst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_opts as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_opts)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreqn>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreqn))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreqn>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreqn))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_address as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_ifindex as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[test]
fn bindgen_test_layout_in_pktinfo() {
    assert_eq!(
        ::std::mem::size_of::<in_pktinfo>(),
        12usize,
        concat!("Size of: ", stringify!(in_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in_pktinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_ifindex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_spec_dst as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_spec_dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_addr)
        )
    );
}
pub const IPPROTO_IP: _bindgen_ty_4 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_4 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_4 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_4 = 4;
pub const IPPROTO_TCP: _bindgen_ty_4 = 6;
pub const IPPROTO_EGP: _bindgen_ty_4 = 8;
pub const IPPROTO_PUP: _bindgen_ty_4 = 12;
pub const IPPROTO_UDP: _bindgen_ty_4 = 17;
pub const IPPROTO_IDP: _bindgen_ty_4 = 22;
pub const IPPROTO_TP: _bindgen_ty_4 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_4 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_4 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_4 = 46;
pub const IPPROTO_GRE: _bindgen_ty_4 = 47;
pub const IPPROTO_ESP: _bindgen_ty_4 = 50;
pub const IPPROTO_AH: _bindgen_ty_4 = 51;
pub const IPPROTO_MTP: _bindgen_ty_4 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_4 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_4 = 98;
pub const IPPROTO_PIM: _bindgen_ty_4 = 103;
pub const IPPROTO_COMP: _bindgen_ty_4 = 108;
pub const IPPROTO_SCTP: _bindgen_ty_4 = 132;
pub const IPPROTO_UDPLITE: _bindgen_ty_4 = 136;
pub const IPPROTO_MPLS: _bindgen_ty_4 = 137;
pub const IPPROTO_RAW: _bindgen_ty_4 = 255;
pub const IPPROTO_MAX: _bindgen_ty_4 = 256;
pub type _bindgen_ty_4 = u32;
pub const IPPROTO_HOPOPTS: _bindgen_ty_5 = 0;
pub const IPPROTO_ROUTING: _bindgen_ty_5 = 43;
pub const IPPROTO_FRAGMENT: _bindgen_ty_5 = 44;
pub const IPPROTO_ICMPV6: _bindgen_ty_5 = 58;
pub const IPPROTO_NONE: _bindgen_ty_5 = 59;
pub const IPPROTO_DSTOPTS: _bindgen_ty_5 = 60;
pub const IPPROTO_MH: _bindgen_ty_5 = 135;
pub type _bindgen_ty_5 = u32;
pub type in_port_t = u16;
pub mod _bindgen_ty_6 {
    pub type Type = u32;
    pub const IPPORT_ECHO: Type = 7;
    pub const IPPORT_DISCARD: Type = 9;
    pub const IPPORT_SYSTAT: Type = 11;
    pub const IPPORT_DAYTIME: Type = 13;
    pub const IPPORT_NETSTAT: Type = 15;
    pub const IPPORT_FTP: Type = 21;
    pub const IPPORT_TELNET: Type = 23;
    pub const IPPORT_SMTP: Type = 25;
    pub const IPPORT_TIMESERVER: Type = 37;
    pub const IPPORT_NAMESERVER: Type = 42;
    pub const IPPORT_WHOIS: Type = 43;
    pub const IPPORT_MTP: Type = 57;
    pub const IPPORT_TFTP: Type = 69;
    pub const IPPORT_RJE: Type = 77;
    pub const IPPORT_FINGER: Type = 79;
    pub const IPPORT_TTYLINK: Type = 87;
    pub const IPPORT_SUPDUP: Type = 95;
    pub const IPPORT_EXECSERVER: Type = 512;
    pub const IPPORT_LOGINSERVER: Type = 513;
    pub const IPPORT_CMDSERVER: Type = 514;
    pub const IPPORT_EFSSERVER: Type = 520;
    pub const IPPORT_BIFFUDP: Type = 512;
    pub const IPPORT_WHOSERVER: Type = 513;
    pub const IPPORT_ROUTESERVER: Type = 520;
    pub const IPPORT_RESERVED: Type = 1024;
    pub const IPPORT_USERRESERVED: Type = 5000;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr8 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in6_addr>())).__in6_u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__in6_u)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}in6addr_any"]
    pub static in6addr_any: in6_addr;
}
extern "C" {
    #[link_name = "\u{1}in6addr_loopback"]
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_zero as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_zero)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_flowinfo as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_scope_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreq>(),
        8usize,
        concat!("Size of: ", stringify!(ip_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq_source() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreq_source>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq_source>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_sourceaddr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_sourceaddr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipv6_mreq() {
    assert_eq!(
        ::std::mem::size_of::<ipv6_mreq>(),
        20usize,
        concat!("Size of: ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ipv6_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_interface as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_interface)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_req() {
    assert_eq!(
        ::std::mem::size_of::<group_req>(),
        136usize,
        concat!("Size of: ", stringify!(group_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_req))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_req>())).gr_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_req>())).gr_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_group)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_source_req() {
    assert_eq!(
        ::std::mem::size_of::<group_source_req>(),
        264usize,
        concat!("Size of: ", stringify!(group_source_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_source_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_source_req))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_source as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_source)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[test]
fn bindgen_test_layout_ip_msfilter() {
    assert_eq!(
        ::std::mem::size_of::<ip_msfilter>(),
        20usize,
        concat!("Size of: ", stringify!(ip_msfilter))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_msfilter>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_msfilter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_fmode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_fmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_numsrc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_numsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_slist as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_slist)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[test]
fn bindgen_test_layout_group_filter() {
    assert_eq!(
        ::std::mem::size_of::<group_filter>(),
        272usize,
        concat!("Size of: ", stringify!(group_filter))
    );
    assert_eq!(
        ::std::mem::align_of::<group_filter>(),
        8usize,
        concat!("Alignment of ", stringify!(group_filter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_fmode as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_fmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_numsrc as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_numsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_slist as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_slist)
        )
    );
}
extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rpcent {
    pub r_name: *mut ::std::os::raw::c_char,
    pub r_aliases: *mut *mut ::std::os::raw::c_char,
    pub r_number: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rpcent() {
    assert_eq!(
        ::std::mem::size_of::<rpcent>(),
        24usize,
        concat!("Size of: ", stringify!(rpcent))
    );
    assert_eq!(
        ::std::mem::align_of::<rpcent>(),
        8usize,
        concat!("Alignment of ", stringify!(rpcent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rpcent>())).r_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rpcent),
            "::",
            stringify!(r_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rpcent>())).r_aliases as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rpcent),
            "::",
            stringify!(r_aliases)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<rpcent>())).r_number as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rpcent),
            "::",
            stringify!(r_number)
        )
    );
}
extern "C" {
    pub fn setrpcent(__stayopen: ::std::os::raw::c_int);
}
extern "C" {
    pub fn endrpcent();
}
extern "C" {
    pub fn getrpcbyname(__name: *const ::std::os::raw::c_char) -> *mut rpcent;
}
extern "C" {
    pub fn getrpcbynumber(__number: ::std::os::raw::c_int) -> *mut rpcent;
}
extern "C" {
    pub fn getrpcent() -> *mut rpcent;
}
extern "C" {
    pub fn getrpcbyname_r(
        __name: *const ::std::os::raw::c_char,
        __result_buf: *mut rpcent,
        __buffer: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut rpcent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getrpcbynumber_r(
        __number: ::std::os::raw::c_int,
        __result_buf: *mut rpcent,
        __buffer: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut rpcent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getrpcent_r(
        __result_buf: *mut rpcent,
        __buffer: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut rpcent,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netent {
    pub n_name: *mut ::std::os::raw::c_char,
    pub n_aliases: *mut *mut ::std::os::raw::c_char,
    pub n_addrtype: ::std::os::raw::c_int,
    pub n_net: u32,
}
#[test]
fn bindgen_test_layout_netent() {
    assert_eq!(
        ::std::mem::size_of::<netent>(),
        24usize,
        concat!("Size of: ", stringify!(netent))
    );
    assert_eq!(
        ::std::mem::align_of::<netent>(),
        8usize,
        concat!("Alignment of ", stringify!(netent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netent>())).n_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netent),
            "::",
            stringify!(n_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netent>())).n_aliases as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netent),
            "::",
            stringify!(n_aliases)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netent>())).n_addrtype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netent),
            "::",
            stringify!(n_addrtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netent>())).n_net as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(netent),
            "::",
            stringify!(n_net)
        )
    );
}
extern "C" {
    pub fn __h_errno_location() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn herror(__str: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn hstrerror(__err_num: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hostent {
    pub h_name: *mut ::std::os::raw::c_char,
    pub h_aliases: *mut *mut ::std::os::raw::c_char,
    pub h_addrtype: ::std::os::raw::c_int,
    pub h_length: ::std::os::raw::c_int,
    pub h_addr_list: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_hostent() {
    assert_eq!(
        ::std::mem::size_of::<hostent>(),
        32usize,
        concat!("Size of: ", stringify!(hostent))
    );
    assert_eq!(
        ::std::mem::align_of::<hostent>(),
        8usize,
        concat!("Alignment of ", stringify!(hostent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hostent>())).h_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hostent),
            "::",
            stringify!(h_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hostent>())).h_aliases as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hostent),
            "::",
            stringify!(h_aliases)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hostent>())).h_addrtype as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hostent),
            "::",
            stringify!(h_addrtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hostent>())).h_length as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(hostent),
            "::",
            stringify!(h_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hostent>())).h_addr_list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(hostent),
            "::",
            stringify!(h_addr_list)
        )
    );
}
extern "C" {
    pub fn sethostent(__stay_open: ::std::os::raw::c_int);
}
extern "C" {
    pub fn endhostent();
}
extern "C" {
    pub fn gethostent() -> *mut hostent;
}
extern "C" {
    pub fn gethostbyaddr(
        __addr: *const ::std::os::raw::c_void,
        __len: __socklen_t,
        __type: ::std::os::raw::c_int,
    ) -> *mut hostent;
}
extern "C" {
    pub fn gethostbyname(__name: *const ::std::os::raw::c_char) -> *mut hostent;
}
extern "C" {
    pub fn gethostbyname2(
        __name: *const ::std::os::raw::c_char,
        __af: ::std::os::raw::c_int,
    ) -> *mut hostent;
}
extern "C" {
    pub fn gethostent_r(
        __result_buf: *mut hostent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut hostent,
        __h_errnop: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostbyaddr_r(
        __addr: *const ::std::os::raw::c_void,
        __len: __socklen_t,
        __type: ::std::os::raw::c_int,
        __result_buf: *mut hostent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut hostent,
        __h_errnop: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostbyname_r(
        __name: *const ::std::os::raw::c_char,
        __result_buf: *mut hostent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut hostent,
        __h_errnop: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gethostbyname2_r(
        __name: *const ::std::os::raw::c_char,
        __af: ::std::os::raw::c_int,
        __result_buf: *mut hostent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut hostent,
        __h_errnop: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setnetent(__stay_open: ::std::os::raw::c_int);
}
extern "C" {
    pub fn endnetent();
}
extern "C" {
    pub fn getnetent() -> *mut netent;
}
extern "C" {
    pub fn getnetbyaddr(__net: u32, __type: ::std::os::raw::c_int) -> *mut netent;
}
extern "C" {
    pub fn getnetbyname(__name: *const ::std::os::raw::c_char) -> *mut netent;
}
extern "C" {
    pub fn getnetent_r(
        __result_buf: *mut netent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut netent,
        __h_errnop: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getnetbyaddr_r(
        __net: u32,
        __type: ::std::os::raw::c_int,
        __result_buf: *mut netent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut netent,
        __h_errnop: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getnetbyname_r(
        __name: *const ::std::os::raw::c_char,
        __result_buf: *mut netent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut netent,
        __h_errnop: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct servent {
    pub s_name: *mut ::std::os::raw::c_char,
    pub s_aliases: *mut *mut ::std::os::raw::c_char,
    pub s_port: ::std::os::raw::c_int,
    pub s_proto: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_servent() {
    assert_eq!(
        ::std::mem::size_of::<servent>(),
        32usize,
        concat!("Size of: ", stringify!(servent))
    );
    assert_eq!(
        ::std::mem::align_of::<servent>(),
        8usize,
        concat!("Alignment of ", stringify!(servent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<servent>())).s_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(servent),
            "::",
            stringify!(s_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<servent>())).s_aliases as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(servent),
            "::",
            stringify!(s_aliases)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<servent>())).s_port as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(servent),
            "::",
            stringify!(s_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<servent>())).s_proto as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(servent),
            "::",
            stringify!(s_proto)
        )
    );
}
extern "C" {
    pub fn setservent(__stay_open: ::std::os::raw::c_int);
}
extern "C" {
    pub fn endservent();
}
extern "C" {
    pub fn getservent() -> *mut servent;
}
extern "C" {
    pub fn getservbyname(
        __name: *const ::std::os::raw::c_char,
        __proto: *const ::std::os::raw::c_char,
    ) -> *mut servent;
}
extern "C" {
    pub fn getservbyport(
        __port: ::std::os::raw::c_int,
        __proto: *const ::std::os::raw::c_char,
    ) -> *mut servent;
}
extern "C" {
    pub fn getservent_r(
        __result_buf: *mut servent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut servent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getservbyname_r(
        __name: *const ::std::os::raw::c_char,
        __proto: *const ::std::os::raw::c_char,
        __result_buf: *mut servent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut servent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getservbyport_r(
        __port: ::std::os::raw::c_int,
        __proto: *const ::std::os::raw::c_char,
        __result_buf: *mut servent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut servent,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct protoent {
    pub p_name: *mut ::std::os::raw::c_char,
    pub p_aliases: *mut *mut ::std::os::raw::c_char,
    pub p_proto: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_protoent() {
    assert_eq!(
        ::std::mem::size_of::<protoent>(),
        24usize,
        concat!("Size of: ", stringify!(protoent))
    );
    assert_eq!(
        ::std::mem::align_of::<protoent>(),
        8usize,
        concat!("Alignment of ", stringify!(protoent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<protoent>())).p_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(protoent),
            "::",
            stringify!(p_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<protoent>())).p_aliases as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(protoent),
            "::",
            stringify!(p_aliases)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<protoent>())).p_proto as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(protoent),
            "::",
            stringify!(p_proto)
        )
    );
}
extern "C" {
    pub fn setprotoent(__stay_open: ::std::os::raw::c_int);
}
extern "C" {
    pub fn endprotoent();
}
extern "C" {
    pub fn getprotoent() -> *mut protoent;
}
extern "C" {
    pub fn getprotobyname(__name: *const ::std::os::raw::c_char) -> *mut protoent;
}
extern "C" {
    pub fn getprotobynumber(__proto: ::std::os::raw::c_int) -> *mut protoent;
}
extern "C" {
    pub fn getprotoent_r(
        __result_buf: *mut protoent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut protoent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getprotobyname_r(
        __name: *const ::std::os::raw::c_char,
        __result_buf: *mut protoent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut protoent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getprotobynumber_r(
        __proto: ::std::os::raw::c_int,
        __result_buf: *mut protoent,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
        __result: *mut *mut protoent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setnetgrent(__netgroup: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn endnetgrent();
}
extern "C" {
    pub fn getnetgrent(
        __hostp: *mut *mut ::std::os::raw::c_char,
        __userp: *mut *mut ::std::os::raw::c_char,
        __domainp: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn innetgr(
        __netgroup: *const ::std::os::raw::c_char,
        __host: *const ::std::os::raw::c_char,
        __user: *const ::std::os::raw::c_char,
        __domain: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getnetgrent_r(
        __hostp: *mut *mut ::std::os::raw::c_char,
        __userp: *mut *mut ::std::os::raw::c_char,
        __domainp: *mut *mut ::std::os::raw::c_char,
        __buffer: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rcmd(
        __ahost: *mut *mut ::std::os::raw::c_char,
        __rport: ::std::os::raw::c_ushort,
        __locuser: *const ::std::os::raw::c_char,
        __remuser: *const ::std::os::raw::c_char,
        __cmd: *const ::std::os::raw::c_char,
        __fd2p: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rcmd_af(
        __ahost: *mut *mut ::std::os::raw::c_char,
        __rport: ::std::os::raw::c_ushort,
        __locuser: *const ::std::os::raw::c_char,
        __remuser: *const ::std::os::raw::c_char,
        __cmd: *const ::std::os::raw::c_char,
        __fd2p: *mut ::std::os::raw::c_int,
        __af: sa_family_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rexec(
        __ahost: *mut *mut ::std::os::raw::c_char,
        __rport: ::std::os::raw::c_int,
        __name: *const ::std::os::raw::c_char,
        __pass: *const ::std::os::raw::c_char,
        __cmd: *const ::std::os::raw::c_char,
        __fd2p: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rexec_af(
        __ahost: *mut *mut ::std::os::raw::c_char,
        __rport: ::std::os::raw::c_int,
        __name: *const ::std::os::raw::c_char,
        __pass: *const ::std::os::raw::c_char,
        __cmd: *const ::std::os::raw::c_char,
        __fd2p: *mut ::std::os::raw::c_int,
        __af: sa_family_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ruserok(
        __rhost: *const ::std::os::raw::c_char,
        __suser: ::std::os::raw::c_int,
        __remuser: *const ::std::os::raw::c_char,
        __locuser: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ruserok_af(
        __rhost: *const ::std::os::raw::c_char,
        __suser: ::std::os::raw::c_int,
        __remuser: *const ::std::os::raw::c_char,
        __locuser: *const ::std::os::raw::c_char,
        __af: sa_family_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iruserok(
        __raddr: u32,
        __suser: ::std::os::raw::c_int,
        __remuser: *const ::std::os::raw::c_char,
        __locuser: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iruserok_af(
        __raddr: *const ::std::os::raw::c_void,
        __suser: ::std::os::raw::c_int,
        __remuser: *const ::std::os::raw::c_char,
        __locuser: *const ::std::os::raw::c_char,
        __af: sa_family_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rresvport(__alport: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rresvport_af(
        __alport: *mut ::std::os::raw::c_int,
        __af: sa_family_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct addrinfo {
    pub ai_flags: ::std::os::raw::c_int,
    pub ai_family: ::std::os::raw::c_int,
    pub ai_socktype: ::std::os::raw::c_int,
    pub ai_protocol: ::std::os::raw::c_int,
    pub ai_addrlen: socklen_t,
    pub ai_addr: *mut sockaddr,
    pub ai_canonname: *mut ::std::os::raw::c_char,
    pub ai_next: *mut addrinfo,
}
#[test]
fn bindgen_test_layout_addrinfo() {
    assert_eq!(
        ::std::mem::size_of::<addrinfo>(),
        48usize,
        concat!("Size of: ", stringify!(addrinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<addrinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(addrinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_family as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_socktype as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_socktype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_protocol as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_protocol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_addrlen as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_addrlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_addr as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_canonname as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_canonname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<addrinfo>())).ai_next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_next)
        )
    );
}
extern "C" {
    pub fn getaddrinfo(
        __name: *const ::std::os::raw::c_char,
        __service: *const ::std::os::raw::c_char,
        __req: *const addrinfo,
        __pai: *mut *mut addrinfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn freeaddrinfo(__ai: *mut addrinfo);
}
extern "C" {
    pub fn gai_strerror(__ecode: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn getnameinfo(
        __sa: *const sockaddr,
        __salen: socklen_t,
        __host: *mut ::std::os::raw::c_char,
        __hostlen: socklen_t,
        __serv: *mut ::std::os::raw::c_char,
        __servlen: socklen_t,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__tzname"]
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    #[link_name = "\u{1}__daylight"]
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__timezone"]
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    #[link_name = "\u{1}tzname"]
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    #[link_name = "\u{1}daylight"]
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}timezone"]
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn stime(__when: *const time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evutil_monotonic_timer {
    _unused: [u8; 0],
}
extern "C" {
    pub fn evutil_date_rfc1123(
        date: *mut ::std::os::raw::c_char,
        datelen: usize,
        tm: *const tm,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_monotonic_timer_new() -> *mut evutil_monotonic_timer;
}
extern "C" {
    pub fn evutil_monotonic_timer_free(timer: *mut evutil_monotonic_timer);
}
extern "C" {
    pub fn evutil_configure_monotonic_time(
        timer: *mut evutil_monotonic_timer,
        flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_gettime_monotonic(
        timer: *mut evutil_monotonic_timer,
        tp: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_socketpair(
        d: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        protocol: ::std::os::raw::c_int,
        sv: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_make_socket_nonblocking(sock: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_make_listen_socket_reuseable(
        sock: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_make_listen_socket_reuseable_port(
        sock: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_make_socket_closeonexec(sock: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_closesocket(sock: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_make_tcp_listen_socket_deferred(
        sock: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_strtoll(
        s: *const ::std::os::raw::c_char,
        endptr: *mut *mut ::std::os::raw::c_char,
        base: ::std::os::raw::c_int,
    ) -> i64;
}
extern "C" {
    pub fn evutil_snprintf(
        buf: *mut ::std::os::raw::c_char,
        buflen: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_vsnprintf(
        buf: *mut ::std::os::raw::c_char,
        buflen: usize,
        format: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_inet_ntop(
        af: ::std::os::raw::c_int,
        src: *const ::std::os::raw::c_void,
        dst: *mut ::std::os::raw::c_char,
        len: usize,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn evutil_inet_pton(
        af: ::std::os::raw::c_int,
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_parse_sockaddr_port(
        str: *const ::std::os::raw::c_char,
        out: *mut sockaddr,
        outlen: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_sockaddr_cmp(
        sa1: *const sockaddr,
        sa2: *const sockaddr,
        include_port: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_ascii_strcasecmp(
        str1: *const ::std::os::raw::c_char,
        str2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_ascii_strncasecmp(
        str1: *const ::std::os::raw::c_char,
        str2: *const ::std::os::raw::c_char,
        n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_getaddrinfo(
        nodename: *const ::std::os::raw::c_char,
        servname: *const ::std::os::raw::c_char,
        hints_in: *const addrinfo,
        res: *mut *mut addrinfo,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_freeaddrinfo(ai: *mut addrinfo);
}
extern "C" {
    pub fn evutil_gai_strerror(err: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn evutil_secure_rng_get_bytes(buf: *mut ::std::os::raw::c_void, n: usize);
}
extern "C" {
    pub fn evutil_secure_rng_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_secure_rng_set_urandom_device_file(
        fname: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evutil_secure_rng_add_bytes(dat: *const ::std::os::raw::c_char, datlen: usize);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evkeyval {
    pub next: evkeyval__bindgen_ty_1,
    pub key: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_char,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evkeyval__bindgen_ty_1 {
    pub tqe_next: *mut evkeyval,
    pub tqe_prev: *mut *mut evkeyval,
}
#[test]
fn bindgen_test_layout_evkeyval__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evkeyval__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(evkeyval__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<evkeyval__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(evkeyval__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evkeyval__bindgen_ty_1>())).tqe_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evkeyval__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evkeyval__bindgen_ty_1>())).tqe_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evkeyval__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_evkeyval() {
    assert_eq!(
        ::std::mem::size_of::<evkeyval>(),
        32usize,
        concat!("Size of: ", stringify!(evkeyval))
    );
    assert_eq!(
        ::std::mem::align_of::<evkeyval>(),
        8usize,
        concat!("Alignment of ", stringify!(evkeyval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evkeyval>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evkeyval),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evkeyval>())).key as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(evkeyval),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evkeyval>())).value as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(evkeyval),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evkeyvalq {
    pub tqh_first: *mut evkeyval,
    pub tqh_last: *mut *mut evkeyval,
}
#[test]
fn bindgen_test_layout_evkeyvalq() {
    assert_eq!(
        ::std::mem::size_of::<evkeyvalq>(),
        16usize,
        concat!("Size of: ", stringify!(evkeyvalq))
    );
    assert_eq!(
        ::std::mem::align_of::<evkeyvalq>(),
        8usize,
        concat!("Alignment of ", stringify!(evkeyvalq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evkeyvalq>())).tqh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evkeyvalq),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evkeyvalq>())).tqh_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evkeyvalq),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct event_callback {
    pub evcb_active_next: event_callback__bindgen_ty_1,
    pub evcb_flags: ::std::os::raw::c_short,
    pub evcb_pri: u8,
    pub evcb_closure: u8,
    pub evcb_cb_union: event_callback__bindgen_ty_2,
    pub evcb_arg: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event_callback__bindgen_ty_1 {
    pub tqe_next: *mut event_callback,
    pub tqe_prev: *mut *mut event_callback,
}
#[test]
fn bindgen_test_layout_event_callback__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<event_callback__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(event_callback__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<event_callback__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(event_callback__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event_callback__bindgen_ty_1>())).tqe_next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event_callback__bindgen_ty_1>())).tqe_prev as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union event_callback__bindgen_ty_2 {
    pub evcb_callback: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::os::raw::c_short,
            arg3: *mut ::std::os::raw::c_void,
        ),
    >,
    pub evcb_selfcb: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut event_callback, arg2: *mut ::std::os::raw::c_void),
    >,
    pub evcb_evfinalize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut event, arg2: *mut ::std::os::raw::c_void),
    >,
    pub evcb_cbfinalize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut event_callback, arg2: *mut ::std::os::raw::c_void),
    >,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_event_callback__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<event_callback__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(event_callback__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<event_callback__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(event_callback__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event_callback__bindgen_ty_2>())).evcb_callback as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback__bindgen_ty_2),
            "::",
            stringify!(evcb_callback)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event_callback__bindgen_ty_2>())).evcb_selfcb as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback__bindgen_ty_2),
            "::",
            stringify!(evcb_selfcb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event_callback__bindgen_ty_2>())).evcb_evfinalize as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback__bindgen_ty_2),
            "::",
            stringify!(evcb_evfinalize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event_callback__bindgen_ty_2>())).evcb_cbfinalize as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback__bindgen_ty_2),
            "::",
            stringify!(evcb_cbfinalize)
        )
    );
}
#[test]
fn bindgen_test_layout_event_callback() {
    assert_eq!(
        ::std::mem::size_of::<event_callback>(),
        40usize,
        concat!("Size of: ", stringify!(event_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<event_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(event_callback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_callback>())).evcb_active_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback),
            "::",
            stringify!(evcb_active_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_callback>())).evcb_flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback),
            "::",
            stringify!(evcb_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_callback>())).evcb_pri as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback),
            "::",
            stringify!(evcb_pri)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_callback>())).evcb_closure as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback),
            "::",
            stringify!(evcb_closure)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_callback>())).evcb_cb_union as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback),
            "::",
            stringify!(evcb_cb_union)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_callback>())).evcb_arg as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(event_callback),
            "::",
            stringify!(evcb_arg)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event_base {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct event {
    pub ev_evcallback: event_callback,
    pub ev_timeout_pos: event__bindgen_ty_1,
    pub ev_fd: ::std::os::raw::c_int,
    pub ev_base: *mut event_base,
    pub ev_: event__bindgen_ty_2,
    pub ev_events: ::std::os::raw::c_short,
    pub ev_res: ::std::os::raw::c_short,
    pub ev_timeout: timeval,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union event__bindgen_ty_1 {
    pub ev_next_with_common_timeout: event__bindgen_ty_1__bindgen_ty_1,
    pub min_heap_idx: ::std::os::raw::c_int,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event__bindgen_ty_1__bindgen_ty_1 {
    pub tqe_next: *mut event,
    pub tqe_prev: *mut *mut event,
}
#[test]
fn bindgen_test_layout_event__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<event__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(event__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<event__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(event__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_1__bindgen_ty_1>())).tqe_next as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_1__bindgen_ty_1>())).tqe_prev as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_event__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<event__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(event__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<event__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(event__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_1>())).ev_next_with_common_timeout as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_1),
            "::",
            stringify!(ev_next_with_common_timeout)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_1>())).min_heap_idx as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_1),
            "::",
            stringify!(min_heap_idx)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union event__bindgen_ty_2 {
    pub ev_io: event__bindgen_ty_2__bindgen_ty_1,
    pub ev_signal: event__bindgen_ty_2__bindgen_ty_2,
    _bindgen_union_align: [u64; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event__bindgen_ty_2__bindgen_ty_1 {
    pub ev_io_next: event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1,
    pub ev_timeout: timeval,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1 {
    pub le_next: *mut event,
    pub le_prev: *mut *mut event,
}
#[test]
fn bindgen_test_layout_event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1>())).le_next
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(le_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1>())).le_prev
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(le_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_event__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<event__bindgen_ty_2__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(event__bindgen_ty_2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<event__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(event__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_1>())).ev_io_next as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ev_io_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_1>())).ev_timeout as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ev_timeout)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event__bindgen_ty_2__bindgen_ty_2 {
    pub ev_signal_next: event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1,
    pub ev_ncalls: ::std::os::raw::c_short,
    pub ev_pncalls: *mut ::std::os::raw::c_short,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1 {
    pub le_next: *mut event,
    pub le_prev: *mut *mut event,
}
#[test]
fn bindgen_test_layout_event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>())).le_next
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(le_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1>())).le_prev
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(le_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_event__bindgen_ty_2__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<event__bindgen_ty_2__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(event__bindgen_ty_2__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<event__bindgen_ty_2__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_2>())).ev_signal_next as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(ev_signal_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_2>())).ev_ncalls as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(ev_ncalls)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<event__bindgen_ty_2__bindgen_ty_2>())).ev_pncalls as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(ev_pncalls)
        )
    );
}
#[test]
fn bindgen_test_layout_event__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<event__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(event__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<event__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(event__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event__bindgen_ty_2>())).ev_io as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2),
            "::",
            stringify!(ev_io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event__bindgen_ty_2>())).ev_signal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event__bindgen_ty_2),
            "::",
            stringify!(ev_signal)
        )
    );
}
#[test]
fn bindgen_test_layout_event() {
    assert_eq!(
        ::std::mem::size_of::<event>(),
        128usize,
        concat!("Size of: ", stringify!(event))
    );
    assert_eq!(
        ::std::mem::align_of::<event>(),
        8usize,
        concat!("Alignment of ", stringify!(event))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_evcallback as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_evcallback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_timeout_pos as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_timeout_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_fd as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_base as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_ as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_events as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_events)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_res as *const _ as usize },
        106usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_res)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event>())).ev_timeout as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(event),
            "::",
            stringify!(ev_timeout)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event_list {
    pub tqh_first: *mut event,
    pub tqh_last: *mut *mut event,
}
#[test]
fn bindgen_test_layout_event_list() {
    assert_eq!(
        ::std::mem::size_of::<event_list>(),
        16usize,
        concat!("Size of: ", stringify!(event_list))
    );
    assert_eq!(
        ::std::mem::align_of::<event_list>(),
        8usize,
        concat!("Alignment of ", stringify!(event_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_list>())).tqh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_list),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_list>())).tqh_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(event_list),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event_dlist {
    pub lh_first: *mut event,
}
#[test]
fn bindgen_test_layout_event_dlist() {
    assert_eq!(
        ::std::mem::size_of::<event_dlist>(),
        8usize,
        concat!("Size of: ", stringify!(event_dlist))
    );
    assert_eq!(
        ::std::mem::align_of::<event_dlist>(),
        8usize,
        concat!("Alignment of ", stringify!(event_dlist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_dlist>())).lh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_dlist),
            "::",
            stringify!(lh_first)
        )
    );
}
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._sbuf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_marker>()))._pos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad1 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad2 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad3 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad4 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type __io_close_fn = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int, arg3: __ssize_t)
        -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void, arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "\u{1}stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "\u{1}stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "\u{1}stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __s: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}sys_nerr"]
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}sys_errlist"]
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event_config {
    _unused: [u8; 0],
}
extern "C" {
    pub fn event_enable_debug_mode();
}
extern "C" {
    pub fn event_debug_unassign(arg1: *mut event);
}
extern "C" {
    pub fn event_base_new() -> *mut event_base;
}
extern "C" {
    pub fn event_reinit(base: *mut event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_dispatch(arg1: *mut event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_get_method(arg1: *const event_base) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn event_get_supported_methods() -> *mut *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn event_gettime_monotonic(
        base: *mut event_base,
        tp: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_get_num_events(
        arg1: *mut event_base,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_get_max_events(
        arg1: *mut event_base,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_config_new() -> *mut event_config;
}
extern "C" {
    pub fn event_config_free(cfg: *mut event_config);
}
extern "C" {
    pub fn event_config_avoid_method(
        cfg: *mut event_config,
        method: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
pub const event_method_feature_EV_FEATURE_ET: event_method_feature = 1;
pub const event_method_feature_EV_FEATURE_O1: event_method_feature = 2;
pub const event_method_feature_EV_FEATURE_FDS: event_method_feature = 4;
pub const event_method_feature_EV_FEATURE_EARLY_CLOSE: event_method_feature = 8;
pub type event_method_feature = u32;
pub const event_base_config_flag_EVENT_BASE_FLAG_NOLOCK: event_base_config_flag = 1;
pub const event_base_config_flag_EVENT_BASE_FLAG_IGNORE_ENV: event_base_config_flag = 2;
pub const event_base_config_flag_EVENT_BASE_FLAG_STARTUP_IOCP: event_base_config_flag = 4;
pub const event_base_config_flag_EVENT_BASE_FLAG_NO_CACHE_TIME: event_base_config_flag = 8;
pub const event_base_config_flag_EVENT_BASE_FLAG_EPOLL_USE_CHANGELIST: event_base_config_flag = 16;
pub const event_base_config_flag_EVENT_BASE_FLAG_PRECISE_TIMER: event_base_config_flag = 32;
pub type event_base_config_flag = u32;
extern "C" {
    pub fn event_base_get_features(base: *const event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_config_require_features(
        cfg: *mut event_config,
        feature: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_config_set_flag(
        cfg: *mut event_config,
        flag: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_config_set_num_cpus_hint(
        cfg: *mut event_config,
        cpus: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_config_set_max_dispatch_interval(
        cfg: *mut event_config,
        max_interval: *const timeval,
        max_callbacks: ::std::os::raw::c_int,
        min_priority: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_new_with_config(arg1: *const event_config) -> *mut event_base;
}
extern "C" {
    pub fn event_base_free(arg1: *mut event_base);
}
extern "C" {
    pub fn event_base_free_nofinalize(arg1: *mut event_base);
}
pub type event_log_cb = ::std::option::Option<
    unsafe extern "C" fn(severity: ::std::os::raw::c_int, msg: *const ::std::os::raw::c_char),
>;
extern "C" {
    pub fn event_set_log_callback(cb: event_log_cb);
}
pub type event_fatal_cb = ::std::option::Option<unsafe extern "C" fn(err: ::std::os::raw::c_int)>;
extern "C" {
    pub fn event_set_fatal_callback(cb: event_fatal_cb);
}
extern "C" {
    pub fn event_enable_debug_logging(which: u32);
}
extern "C" {
    pub fn event_base_set(arg1: *mut event_base, arg2: *mut event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_loop(
        arg1: *mut event_base,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_loopexit(
        arg1: *mut event_base,
        arg2: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_loopbreak(arg1: *mut event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_loopcontinue(arg1: *mut event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_got_exit(arg1: *mut event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_got_break(arg1: *mut event_base) -> ::std::os::raw::c_int;
}
pub type event_callback_fn = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_short,
        arg3: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn event_self_cbarg() -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn event_new(
        arg1: *mut event_base,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_short,
        arg4: event_callback_fn,
        arg5: *mut ::std::os::raw::c_void,
    ) -> *mut event;
}
extern "C" {
    pub fn event_assign(
        arg1: *mut event,
        arg2: *mut event_base,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_short,
        arg5: event_callback_fn,
        arg6: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_free(arg1: *mut event);
}
pub type event_finalize_callback_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut event, arg2: *mut ::std::os::raw::c_void),
>;
extern "C" {
    pub fn event_finalize(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut event,
        arg3: event_finalize_callback_fn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_free_finalize(
        arg1: ::std::os::raw::c_uint,
        arg2: *mut event,
        arg3: event_finalize_callback_fn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_once(
        arg1: *mut event_base,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_short,
        arg4: event_callback_fn,
        arg5: *mut ::std::os::raw::c_void,
        arg6: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_add(ev: *mut event, timeout: *const timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_remove_timer(ev: *mut event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_del(arg1: *mut event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_del_noblock(ev: *mut event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_del_block(ev: *mut event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_active(
        ev: *mut event,
        res: ::std::os::raw::c_int,
        ncalls: ::std::os::raw::c_short,
    );
}
extern "C" {
    pub fn event_pending(
        ev: *const event,
        events: ::std::os::raw::c_short,
        tv: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_get_running_event(base: *mut event_base) -> *mut event;
}
extern "C" {
    pub fn event_initialized(ev: *const event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_get_fd(ev: *const event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_get_base(ev: *const event) -> *mut event_base;
}
extern "C" {
    pub fn event_get_events(ev: *const event) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn event_get_callback(ev: *const event) -> event_callback_fn;
}
extern "C" {
    pub fn event_get_callback_arg(ev: *const event) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn event_get_priority(ev: *const event) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_get_assignment(
        event: *const event,
        base_out: *mut *mut event_base,
        fd_out: *mut ::std::os::raw::c_int,
        events_out: *mut ::std::os::raw::c_short,
        callback_out: *mut event_callback_fn,
        arg_out: *mut *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn event_get_struct_event_size() -> usize;
}
extern "C" {
    pub fn event_get_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn event_get_version_number() -> u32;
}
extern "C" {
    pub fn event_base_priority_init(
        arg1: *mut event_base,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_get_npriorities(eb: *mut event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_priority_set(
        arg1: *mut event,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_init_common_timeout(
        base: *mut event_base,
        duration: *const timeval,
    ) -> *const timeval;
}
extern "C" {
    pub fn event_set_mem_functions(
        malloc_fn: ::std::option::Option<
            unsafe extern "C" fn(sz: usize) -> *mut ::std::os::raw::c_void,
        >,
        realloc_fn: ::std::option::Option<
            unsafe extern "C" fn(
                ptr: *mut ::std::os::raw::c_void,
                sz: usize,
            ) -> *mut ::std::os::raw::c_void,
        >,
        free_fn: ::std::option::Option<unsafe extern "C" fn(ptr: *mut ::std::os::raw::c_void)>,
    );
}
extern "C" {
    pub fn event_base_dump_events(arg1: *mut event_base, arg2: *mut FILE);
}
extern "C" {
    pub fn event_base_active_by_fd(
        base: *mut event_base,
        fd: ::std::os::raw::c_int,
        events: ::std::os::raw::c_short,
    );
}
extern "C" {
    pub fn event_base_active_by_signal(base: *mut event_base, sig: ::std::os::raw::c_int);
}
pub type event_base_foreach_event_cb = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const event_base,
        arg2: *const event,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn event_base_foreach_event(
        base: *mut event_base,
        fn_: event_base_foreach_event_cb,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_gettimeofday_cached(
        base: *mut event_base,
        tv: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_base_update_cache_time(base: *mut event_base) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn libevent_global_shutdown();
}
extern "C" {
    pub fn event_init() -> *mut event_base;
}
extern "C" {
    pub fn event_dispatch() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_loop(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_loopexit(arg1: *const timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_loopbreak() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_once(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_short,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_short,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
        arg4: *mut ::std::os::raw::c_void,
        arg5: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_get_method() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn event_priority_init(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn event_set(
        arg1: *mut event,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_short,
        arg4: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: ::std::os::raw::c_int,
                arg2: ::std::os::raw::c_short,
                arg3: *mut ::std::os::raw::c_void,
            ),
        >,
        arg5: *mut ::std::os::raw::c_void,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evbuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evbuffer_ptr {
    pub pos: isize,
    pub internal_: evbuffer_ptr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evbuffer_ptr__bindgen_ty_1 {
    pub chain: *mut ::std::os::raw::c_void,
    pub pos_in_chain: usize,
}
#[test]
fn bindgen_test_layout_evbuffer_ptr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<evbuffer_ptr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(evbuffer_ptr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<evbuffer_ptr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(evbuffer_ptr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evbuffer_ptr__bindgen_ty_1>())).chain as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evbuffer_ptr__bindgen_ty_1),
            "::",
            stringify!(chain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<evbuffer_ptr__bindgen_ty_1>())).pos_in_chain as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evbuffer_ptr__bindgen_ty_1),
            "::",
            stringify!(pos_in_chain)
        )
    );
}
#[test]
fn bindgen_test_layout_evbuffer_ptr() {
    assert_eq!(
        ::std::mem::size_of::<evbuffer_ptr>(),
        24usize,
        concat!("Size of: ", stringify!(evbuffer_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<evbuffer_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(evbuffer_ptr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evbuffer_ptr>())).pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evbuffer_ptr),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evbuffer_ptr>())).internal_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evbuffer_ptr),
            "::",
            stringify!(internal_)
        )
    );
}
extern "C" {
    pub fn evbuffer_new() -> *mut evbuffer;
}
extern "C" {
    pub fn evbuffer_free(buf: *mut evbuffer);
}
extern "C" {
    pub fn evbuffer_enable_locking(
        buf: *mut evbuffer,
        lock: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_lock(buf: *mut evbuffer);
}
extern "C" {
    pub fn evbuffer_unlock(buf: *mut evbuffer);
}
extern "C" {
    pub fn evbuffer_set_flags(buf: *mut evbuffer, flags: u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_clear_flags(buf: *mut evbuffer, flags: u64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_get_length(buf: *const evbuffer) -> usize;
}
extern "C" {
    pub fn evbuffer_get_contiguous_space(buf: *const evbuffer) -> usize;
}
extern "C" {
    pub fn evbuffer_expand(buf: *mut evbuffer, datlen: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_reserve_space(
        buf: *mut evbuffer,
        size: isize,
        vec: *mut iovec,
        n_vec: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_commit_space(
        buf: *mut evbuffer,
        vec: *mut iovec,
        n_vecs: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_add(
        buf: *mut evbuffer,
        data: *const ::std::os::raw::c_void,
        datlen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_remove(
        buf: *mut evbuffer,
        data: *mut ::std::os::raw::c_void,
        datlen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_copyout(
        buf: *mut evbuffer,
        data_out: *mut ::std::os::raw::c_void,
        datlen: usize,
    ) -> isize;
}
extern "C" {
    pub fn evbuffer_copyout_from(
        buf: *mut evbuffer,
        pos: *const evbuffer_ptr,
        data_out: *mut ::std::os::raw::c_void,
        datlen: usize,
    ) -> isize;
}
extern "C" {
    pub fn evbuffer_remove_buffer(
        src: *mut evbuffer,
        dst: *mut evbuffer,
        datlen: usize,
    ) -> ::std::os::raw::c_int;
}
pub const evbuffer_eol_style_EVBUFFER_EOL_ANY: evbuffer_eol_style = 0;
pub const evbuffer_eol_style_EVBUFFER_EOL_CRLF: evbuffer_eol_style = 1;
pub const evbuffer_eol_style_EVBUFFER_EOL_CRLF_STRICT: evbuffer_eol_style = 2;
pub const evbuffer_eol_style_EVBUFFER_EOL_LF: evbuffer_eol_style = 3;
pub const evbuffer_eol_style_EVBUFFER_EOL_NUL: evbuffer_eol_style = 4;
pub type evbuffer_eol_style = u32;
extern "C" {
    pub fn evbuffer_readln(
        buffer: *mut evbuffer,
        n_read_out: *mut usize,
        eol_style: evbuffer_eol_style,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn evbuffer_add_buffer(
        outbuf: *mut evbuffer,
        inbuf: *mut evbuffer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_add_buffer_reference(
        outbuf: *mut evbuffer,
        inbuf: *mut evbuffer,
    ) -> ::std::os::raw::c_int;
}
pub type evbuffer_ref_cleanup_cb = ::std::option::Option<
    unsafe extern "C" fn(
        data: *const ::std::os::raw::c_void,
        datalen: usize,
        extra: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn evbuffer_add_reference(
        outbuf: *mut evbuffer,
        data: *const ::std::os::raw::c_void,
        datlen: usize,
        cleanupfn: evbuffer_ref_cleanup_cb,
        cleanupfn_arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_add_file(
        outbuf: *mut evbuffer,
        fd: ::std::os::raw::c_int,
        offset: i64,
        length: i64,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evbuffer_file_segment {
    _unused: [u8; 0],
}
pub type evbuffer_file_segment_cleanup_cb = ::std::option::Option<
    unsafe extern "C" fn(
        seg: *const evbuffer_file_segment,
        flags: ::std::os::raw::c_int,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn evbuffer_file_segment_new(
        fd: ::std::os::raw::c_int,
        offset: i64,
        length: i64,
        flags: ::std::os::raw::c_uint,
    ) -> *mut evbuffer_file_segment;
}
extern "C" {
    pub fn evbuffer_file_segment_free(seg: *mut evbuffer_file_segment);
}
extern "C" {
    pub fn evbuffer_file_segment_add_cleanup_cb(
        seg: *mut evbuffer_file_segment,
        cb: evbuffer_file_segment_cleanup_cb,
        arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn evbuffer_add_file_segment(
        buf: *mut evbuffer,
        seg: *mut evbuffer_file_segment,
        offset: i64,
        length: i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_add_printf(
        buf: *mut evbuffer,
        fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_add_vprintf(
        buf: *mut evbuffer,
        fmt: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_drain(buf: *mut evbuffer, len: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_write(
        buffer: *mut evbuffer,
        fd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_write_atmost(
        buffer: *mut evbuffer,
        fd: ::std::os::raw::c_int,
        howmuch: isize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_read(
        buffer: *mut evbuffer,
        fd: ::std::os::raw::c_int,
        howmuch: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_search(
        buffer: *mut evbuffer,
        what: *const ::std::os::raw::c_char,
        len: usize,
        start: *const evbuffer_ptr,
    ) -> evbuffer_ptr;
}
extern "C" {
    pub fn evbuffer_search_range(
        buffer: *mut evbuffer,
        what: *const ::std::os::raw::c_char,
        len: usize,
        start: *const evbuffer_ptr,
        end: *const evbuffer_ptr,
    ) -> evbuffer_ptr;
}
pub const evbuffer_ptr_how_EVBUFFER_PTR_SET: evbuffer_ptr_how = 0;
pub const evbuffer_ptr_how_EVBUFFER_PTR_ADD: evbuffer_ptr_how = 1;
pub type evbuffer_ptr_how = u32;
extern "C" {
    pub fn evbuffer_ptr_set(
        buffer: *mut evbuffer,
        ptr: *mut evbuffer_ptr,
        position: usize,
        how: evbuffer_ptr_how,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_search_eol(
        buffer: *mut evbuffer,
        start: *mut evbuffer_ptr,
        eol_len_out: *mut usize,
        eol_style: evbuffer_eol_style,
    ) -> evbuffer_ptr;
}
extern "C" {
    pub fn evbuffer_peek(
        buffer: *mut evbuffer,
        len: isize,
        start_at: *mut evbuffer_ptr,
        vec_out: *mut iovec,
        n_vec: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evbuffer_cb_info {
    pub orig_size: usize,
    pub n_added: usize,
    pub n_deleted: usize,
}
#[test]
fn bindgen_test_layout_evbuffer_cb_info() {
    assert_eq!(
        ::std::mem::size_of::<evbuffer_cb_info>(),
        24usize,
        concat!("Size of: ", stringify!(evbuffer_cb_info))
    );
    assert_eq!(
        ::std::mem::align_of::<evbuffer_cb_info>(),
        8usize,
        concat!("Alignment of ", stringify!(evbuffer_cb_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evbuffer_cb_info>())).orig_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(evbuffer_cb_info),
            "::",
            stringify!(orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evbuffer_cb_info>())).n_added as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(evbuffer_cb_info),
            "::",
            stringify!(n_added)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<evbuffer_cb_info>())).n_deleted as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(evbuffer_cb_info),
            "::",
            stringify!(n_deleted)
        )
    );
}
pub type evbuffer_cb_func = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *mut evbuffer,
        info: *const evbuffer_cb_info,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evbuffer_cb_entry {
    _unused: [u8; 0],
}
extern "C" {
    pub fn evbuffer_add_cb(
        buffer: *mut evbuffer,
        cb: evbuffer_cb_func,
        cbarg: *mut ::std::os::raw::c_void,
    ) -> *mut evbuffer_cb_entry;
}
extern "C" {
    pub fn evbuffer_remove_cb_entry(
        buffer: *mut evbuffer,
        ent: *mut evbuffer_cb_entry,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_remove_cb(
        buffer: *mut evbuffer,
        cb: evbuffer_cb_func,
        cbarg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_cb_set_flags(
        buffer: *mut evbuffer,
        cb: *mut evbuffer_cb_entry,
        flags: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_cb_clear_flags(
        buffer: *mut evbuffer,
        cb: *mut evbuffer_cb_entry,
        flags: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_pullup(buf: *mut evbuffer, size: isize) -> *mut ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn evbuffer_prepend(
        buf: *mut evbuffer,
        data: *const ::std::os::raw::c_void,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_prepend_buffer(dst: *mut evbuffer, src: *mut evbuffer)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_freeze(
        buf: *mut evbuffer,
        at_front: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_unfreeze(
        buf: *mut evbuffer,
        at_front: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_defer_callbacks(
        buffer: *mut evbuffer,
        base: *mut event_base,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evbuffer_add_iovec(
        buffer: *mut evbuffer,
        vec: *mut iovec,
        n_vec: ::std::os::raw::c_int,
    ) -> usize;
}
extern "C" {
    pub fn evbuffer_readline(buffer: *mut evbuffer) -> *mut ::std::os::raw::c_char;
}
pub type evbuffer_cb = ::std::option::Option<
    unsafe extern "C" fn(
        buffer: *mut evbuffer,
        old_len: usize,
        new_len: usize,
        arg: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn evbuffer_setcb(
        buffer: *mut evbuffer,
        cb: evbuffer_cb,
        cbarg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn evbuffer_find(
        buffer: *mut evbuffer,
        what: *const ::std::os::raw::c_uchar,
        len: usize,
    ) -> *mut ::std::os::raw::c_uchar;
}
pub type bufferevent_data_cb = ::std::option::Option<
    unsafe extern "C" fn(bev: *mut bufferevent, ctx: *mut ::std::os::raw::c_void),
>;
pub type bufferevent_event_cb = ::std::option::Option<
    unsafe extern "C" fn(
        bev: *mut bufferevent,
        what: ::std::os::raw::c_short,
        ctx: *mut ::std::os::raw::c_void,
    ),
>;
pub const bufferevent_options_BEV_OPT_CLOSE_ON_FREE: bufferevent_options = 1;
pub const bufferevent_options_BEV_OPT_THREADSAFE: bufferevent_options = 2;
pub const bufferevent_options_BEV_OPT_DEFER_CALLBACKS: bufferevent_options = 4;
pub const bufferevent_options_BEV_OPT_UNLOCK_CALLBACKS: bufferevent_options = 8;
pub type bufferevent_options = u32;
extern "C" {
    pub fn bufferevent_socket_new(
        base: *mut event_base,
        fd: ::std::os::raw::c_int,
        options: ::std::os::raw::c_int,
    ) -> *mut bufferevent;
}
extern "C" {
    pub fn bufferevent_socket_connect(
        arg1: *mut bufferevent,
        arg2: *const sockaddr,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct evdns_base {
    _unused: [u8; 0],
}
extern "C" {
    pub fn bufferevent_socket_connect_hostname(
        arg1: *mut bufferevent,
        arg2: *mut evdns_base,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_socket_get_dns_error(bev: *mut bufferevent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_base_set(
        base: *mut event_base,
        bufev: *mut bufferevent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_get_base(bev: *mut bufferevent) -> *mut event_base;
}
extern "C" {
    pub fn bufferevent_priority_set(
        bufev: *mut bufferevent,
        pri: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_get_priority(bufev: *const bufferevent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_free(bufev: *mut bufferevent);
}
extern "C" {
    pub fn bufferevent_setcb(
        bufev: *mut bufferevent,
        readcb: bufferevent_data_cb,
        writecb: bufferevent_data_cb,
        eventcb: bufferevent_event_cb,
        cbarg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn bufferevent_getcb(
        bufev: *mut bufferevent,
        readcb_ptr: *mut bufferevent_data_cb,
        writecb_ptr: *mut bufferevent_data_cb,
        eventcb_ptr: *mut bufferevent_event_cb,
        cbarg_ptr: *mut *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn bufferevent_setfd(
        bufev: *mut bufferevent,
        fd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_getfd(bufev: *mut bufferevent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_get_underlying(bufev: *mut bufferevent) -> *mut bufferevent;
}
extern "C" {
    pub fn bufferevent_write(
        bufev: *mut bufferevent,
        data: *const ::std::os::raw::c_void,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_write_buffer(
        bufev: *mut bufferevent,
        buf: *mut evbuffer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_read(
        bufev: *mut bufferevent,
        data: *mut ::std::os::raw::c_void,
        size: usize,
    ) -> usize;
}
extern "C" {
    pub fn bufferevent_read_buffer(
        bufev: *mut bufferevent,
        buf: *mut evbuffer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_get_input(bufev: *mut bufferevent) -> *mut evbuffer;
}
extern "C" {
    pub fn bufferevent_get_output(bufev: *mut bufferevent) -> *mut evbuffer;
}
extern "C" {
    pub fn bufferevent_enable(
        bufev: *mut bufferevent,
        event: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_disable(
        bufev: *mut bufferevent,
        event: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_get_enabled(bufev: *mut bufferevent) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn bufferevent_set_timeouts(
        bufev: *mut bufferevent,
        timeout_read: *const timeval,
        timeout_write: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_setwatermark(
        bufev: *mut bufferevent,
        events: ::std::os::raw::c_short,
        lowmark: usize,
        highmark: usize,
    );
}
extern "C" {
    pub fn bufferevent_getwatermark(
        bufev: *mut bufferevent,
        events: ::std::os::raw::c_short,
        lowmark: *mut usize,
        highmark: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_lock(bufev: *mut bufferevent);
}
extern "C" {
    pub fn bufferevent_unlock(bufev: *mut bufferevent);
}
extern "C" {
    pub fn bufferevent_incref(bufev: *mut bufferevent);
}
extern "C" {
    pub fn bufferevent_decref(bufev: *mut bufferevent) -> ::std::os::raw::c_int;
}
pub const bufferevent_flush_mode_BEV_NORMAL: bufferevent_flush_mode = 0;
pub const bufferevent_flush_mode_BEV_FLUSH: bufferevent_flush_mode = 1;
pub const bufferevent_flush_mode_BEV_FINISHED: bufferevent_flush_mode = 2;
pub type bufferevent_flush_mode = u32;
extern "C" {
    pub fn bufferevent_flush(
        bufev: *mut bufferevent,
        iotype: ::std::os::raw::c_short,
        mode: bufferevent_flush_mode,
    ) -> ::std::os::raw::c_int;
}
pub const bufferevent_trigger_options_BEV_TRIG_IGNORE_WATERMARKS: bufferevent_trigger_options =
    65536;
pub const bufferevent_trigger_options_BEV_TRIG_DEFER_CALLBACKS: bufferevent_trigger_options = 4;
pub type bufferevent_trigger_options = u32;
extern "C" {
    pub fn bufferevent_trigger(
        bufev: *mut bufferevent,
        iotype: ::std::os::raw::c_short,
        options: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn bufferevent_trigger_event(
        bufev: *mut bufferevent,
        what: ::std::os::raw::c_short,
        options: ::std::os::raw::c_int,
    );
}
pub const bufferevent_filter_result_BEV_OK: bufferevent_filter_result = 0;
pub const bufferevent_filter_result_BEV_NEED_MORE: bufferevent_filter_result = 1;
pub const bufferevent_filter_result_BEV_ERROR: bufferevent_filter_result = 2;
pub type bufferevent_filter_result = u32;
pub type bufferevent_filter_cb = ::std::option::Option<
    unsafe extern "C" fn(
        src: *mut evbuffer,
        dst: *mut evbuffer,
        dst_limit: isize,
        mode: bufferevent_flush_mode,
        ctx: *mut ::std::os::raw::c_void,
    ) -> bufferevent_filter_result,
>;
extern "C" {
    pub fn bufferevent_filter_new(
        underlying: *mut bufferevent,
        input_filter: bufferevent_filter_cb,
        output_filter: bufferevent_filter_cb,
        options: ::std::os::raw::c_int,
        free_context: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
        >,
        ctx: *mut ::std::os::raw::c_void,
    ) -> *mut bufferevent;
}
extern "C" {
    pub fn bufferevent_pair_new(
        base: *mut event_base,
        options: ::std::os::raw::c_int,
        pair: *mut *mut bufferevent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_pair_get_partner(bev: *mut bufferevent) -> *mut bufferevent;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ev_token_bucket_cfg {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bufferevent_rate_limit_group {
    _unused: [u8; 0],
}
extern "C" {
    pub fn ev_token_bucket_cfg_new(
        read_rate: usize,
        read_burst: usize,
        write_rate: usize,
        write_burst: usize,
        tick_len: *const timeval,
    ) -> *mut ev_token_bucket_cfg;
}
extern "C" {
    pub fn ev_token_bucket_cfg_free(cfg: *mut ev_token_bucket_cfg);
}
extern "C" {
    pub fn bufferevent_set_rate_limit(
        bev: *mut bufferevent,
        cfg: *mut ev_token_bucket_cfg,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_new(
        base: *mut event_base,
        cfg: *const ev_token_bucket_cfg,
    ) -> *mut bufferevent_rate_limit_group;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_set_cfg(
        arg1: *mut bufferevent_rate_limit_group,
        arg2: *const ev_token_bucket_cfg,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_set_min_share(
        arg1: *mut bufferevent_rate_limit_group,
        arg2: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_free(arg1: *mut bufferevent_rate_limit_group);
}
extern "C" {
    pub fn bufferevent_add_to_rate_limit_group(
        bev: *mut bufferevent,
        g: *mut bufferevent_rate_limit_group,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_remove_from_rate_limit_group(bev: *mut bufferevent)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_set_max_single_read(
        bev: *mut bufferevent,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_set_max_single_write(
        bev: *mut bufferevent,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_get_max_single_read(bev: *mut bufferevent) -> isize;
}
extern "C" {
    pub fn bufferevent_get_max_single_write(bev: *mut bufferevent) -> isize;
}
extern "C" {
    pub fn bufferevent_get_read_limit(bev: *mut bufferevent) -> isize;
}
extern "C" {
    pub fn bufferevent_get_write_limit(bev: *mut bufferevent) -> isize;
}
extern "C" {
    pub fn bufferevent_get_max_to_read(bev: *mut bufferevent) -> isize;
}
extern "C" {
    pub fn bufferevent_get_max_to_write(bev: *mut bufferevent) -> isize;
}
extern "C" {
    pub fn bufferevent_get_token_bucket_cfg(bev: *const bufferevent) -> *const ev_token_bucket_cfg;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_get_read_limit(
        arg1: *mut bufferevent_rate_limit_group,
    ) -> isize;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_get_write_limit(
        arg1: *mut bufferevent_rate_limit_group,
    ) -> isize;
}
extern "C" {
    pub fn bufferevent_decrement_read_limit(
        bev: *mut bufferevent,
        decr: isize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_decrement_write_limit(
        bev: *mut bufferevent,
        decr: isize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_decrement_read(
        arg1: *mut bufferevent_rate_limit_group,
        arg2: isize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_decrement_write(
        arg1: *mut bufferevent_rate_limit_group,
        arg2: isize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bufferevent_rate_limit_group_get_totals(
        grp: *mut bufferevent_rate_limit_group,
        total_read_out: *mut u64,
        total_written_out: *mut u64,
    );
}
extern "C" {
    pub fn bufferevent_rate_limit_group_reset_totals(grp: *mut bufferevent_rate_limit_group);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct event_watermark {
    pub low: usize,
    pub high: usize,
}
#[test]
fn bindgen_test_layout_event_watermark() {
    assert_eq!(
        ::std::mem::size_of::<event_watermark>(),
        16usize,
        concat!("Size of: ", stringify!(event_watermark))
    );
    assert_eq!(
        ::std::mem::align_of::<event_watermark>(),
        8usize,
        concat!("Alignment of ", stringify!(event_watermark))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_watermark>())).low as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(event_watermark),
            "::",
            stringify!(low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<event_watermark>())).high as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(event_watermark),
            "::",
            stringify!(high)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct bufferevent {
    pub ev_base: *mut event_base,
    pub be_ops: *mut bufferevent_ops,
    pub ev_read: event,
    pub ev_write: event,
    pub input: *mut evbuffer,
    pub output: *mut evbuffer,
    pub wm_read: event_watermark,
    pub wm_write: event_watermark,
    pub readcb: bufferevent_data_cb,
    pub writecb: bufferevent_data_cb,
    pub errorcb: bufferevent_event_cb,
    pub cbarg: *mut ::std::os::raw::c_void,
    pub timeout_read: timeval,
    pub timeout_write: timeval,
    pub enabled: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_bufferevent() {
    assert_eq!(
        ::std::mem::size_of::<bufferevent>(),
        392usize,
        concat!("Size of: ", stringify!(bufferevent))
    );
    assert_eq!(
        ::std::mem::align_of::<bufferevent>(),
        8usize,
        concat!("Alignment of ", stringify!(bufferevent))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).ev_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(ev_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).be_ops as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(be_ops)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).ev_read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(ev_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).ev_write as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(ev_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).input as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).output as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(output)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).wm_read as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(wm_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).wm_write as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(wm_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).readcb as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(readcb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).writecb as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(writecb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).errorcb as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(errorcb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).cbarg as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(cbarg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).timeout_read as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(timeout_read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).timeout_write as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(timeout_write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<bufferevent>())).enabled as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(bufferevent),
            "::",
            stringify!(enabled)
        )
    );
}
extern "C" {
    pub fn bufferevent_new(
        fd: ::std::os::raw::c_int,
        readcb: bufferevent_data_cb,
        writecb: bufferevent_data_cb,
        errorcb: bufferevent_event_cb,
        cbarg: *mut ::std::os::raw::c_void,
    ) -> *mut bufferevent;
}
extern "C" {
    pub fn bufferevent_settimeout(
        bufev: *mut bufferevent,
        timeout_read: ::std::os::raw::c_int,
        timeout_write: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn evtag_init();
}
extern "C" {
    pub fn evtag_unmarshal_header(evbuf: *mut evbuffer, ptag: *mut u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_marshal(
        evbuf: *mut evbuffer,
        tag: u32,
        data: *const ::std::os::raw::c_void,
        len: u32,
    );
}
extern "C" {
    pub fn evtag_marshal_buffer(evbuf: *mut evbuffer, tag: u32, data: *mut evbuffer);
}
extern "C" {
    pub fn evtag_encode_int(evbuf: *mut evbuffer, number: u32);
}
extern "C" {
    pub fn evtag_encode_int64(evbuf: *mut evbuffer, number: u64);
}
extern "C" {
    pub fn evtag_marshal_int(evbuf: *mut evbuffer, tag: u32, integer: u32);
}
extern "C" {
    pub fn evtag_marshal_int64(evbuf: *mut evbuffer, tag: u32, integer: u64);
}
extern "C" {
    pub fn evtag_marshal_string(
        buf: *mut evbuffer,
        tag: u32,
        string: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn evtag_marshal_timeval(evbuf: *mut evbuffer, tag: u32, tv: *mut timeval);
}
extern "C" {
    pub fn evtag_unmarshal(
        src: *mut evbuffer,
        ptag: *mut u32,
        dst: *mut evbuffer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_peek(evbuf: *mut evbuffer, ptag: *mut u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_peek_length(evbuf: *mut evbuffer, plength: *mut u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_payload_length(evbuf: *mut evbuffer, plength: *mut u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_consume(evbuf: *mut evbuffer) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_unmarshal_int(
        evbuf: *mut evbuffer,
        need_tag: u32,
        pinteger: *mut u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_unmarshal_int64(
        evbuf: *mut evbuffer,
        need_tag: u32,
        pinteger: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_unmarshal_fixed(
        src: *mut evbuffer,
        need_tag: u32,
        data: *mut ::std::os::raw::c_void,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_unmarshal_string(
        evbuf: *mut evbuffer,
        need_tag: u32,
        pstring: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn evtag_unmarshal_timeval(
        evbuf: *mut evbuffer,
        need_tag: u32,
        ptv: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
pub type cc_t = ::std::os::raw::c_uchar;
pub type speed_t = ::std::os::raw::c_uint;
pub type tcflag_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct termios {
    pub c_iflag: tcflag_t,
    pub c_oflag: tcflag_t,
    pub c_cflag: tcflag_t,
    pub c_lflag: tcflag_t,
    pub c_line: cc_t,
    pub c_cc: [cc_t; 32usize],
    pub c_ispeed: speed_t,
    pub c_ospeed: speed_t,
}
#[test]
fn bindgen_test_layout_termios() {
    assert_eq!(
        ::std::mem::size_of::<termios>(),
        60usize,
        concat!("Size of: ", stringify!(termios))
    );
    assert_eq!(
        ::std::mem::align_of::<termios>(),
        4usize,
        concat!("Alignment of ", stringify!(termios))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_iflag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_iflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_oflag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_oflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_cflag as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_cflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_lflag as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_lflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_line as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_cc as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_cc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_ispeed as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_ispeed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termios>())).c_ospeed as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(termios),
            "::",
            stringify!(c_ospeed)
        )
    );
}
extern "C" {
    pub fn cfgetospeed(__termios_p: *const termios) -> speed_t;
}
extern "C" {
    pub fn cfgetispeed(__termios_p: *const termios) -> speed_t;
}
extern "C" {
    pub fn cfsetospeed(__termios_p: *mut termios, __speed: speed_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfsetispeed(__termios_p: *mut termios, __speed: speed_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfsetspeed(__termios_p: *mut termios, __speed: speed_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcgetattr(
        __fd: ::std::os::raw::c_int,
        __termios_p: *mut termios,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcsetattr(
        __fd: ::std::os::raw::c_int,
        __optional_actions: ::std::os::raw::c_int,
        __termios_p: *const termios,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cfmakeraw(__termios_p: *mut termios);
}
extern "C" {
    pub fn tcsendbreak(
        __fd: ::std::os::raw::c_int,
        __duration: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcdrain(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcflush(
        __fd: ::std::os::raw::c_int,
        __queue_selector: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcflow(
        __fd: ::std::os::raw::c_int,
        __action: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tcgetsid(__fd: ::std::os::raw::c_int) -> __pid_t;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
pub type wint_t = ::std::os::raw::c_uint;
pub type mbstate_t = __mbstate_t;
extern "C" {
    pub fn wcscpy(__dest: *mut wchar_t, __src: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncpy(__dest: *mut wchar_t, __src: *const wchar_t, __n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscat(__dest: *mut wchar_t, __src: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncat(__dest: *mut wchar_t, __src: *const wchar_t, __n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(
        __s1: *const ::std::os::raw::c_int,
        __s2: *const ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsncmp(
        __s1: *const ::std::os::raw::c_int,
        __s2: *const ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscasecmp(__s1: *const wchar_t, __s2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsncasecmp(
        __s1: *const wchar_t,
        __s2: *const wchar_t,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscasecmp_l(
        __s1: *const wchar_t,
        __s2: *const wchar_t,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsncasecmp_l(
        __s1: *const wchar_t,
        __s2: *const wchar_t,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscoll(__s1: *const wchar_t, __s2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsxfrm(__s1: *mut wchar_t, __s2: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn wcscoll_l(
        __s1: *const wchar_t,
        __s2: *const wchar_t,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsxfrm_l(
        __s1: *mut wchar_t,
        __s2: *const wchar_t,
        __n: usize,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wcsdup(__s: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcschr(
        __wcs: *const ::std::os::raw::c_int,
        __wc: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsrchr(__wcs: *const wchar_t, __wc: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscspn(__wcs: *const wchar_t, __reject: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcsspn(__wcs: *const wchar_t, __accept: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcspbrk(__wcs: *const wchar_t, __accept: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsstr(__haystack: *const wchar_t, __needle: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstok(
        __s: *mut wchar_t,
        __delim: *const wchar_t,
        __ptr: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcslen(__s: *const ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn wcsnlen(__s: *const wchar_t, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn wmemchr(
        __s: *const ::std::os::raw::c_int,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn wmemcmp(
        __s1: *const ::std::os::raw::c_int,
        __s2: *const ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wmemcpy(__s1: *mut wchar_t, __s2: *const wchar_t, __n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wmemmove(__s1: *mut wchar_t, __s2: *const wchar_t, __n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wmemset(__s: *mut wchar_t, __c: wchar_t, __n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn btowc(__c: ::std::os::raw::c_int) -> wint_t;
}
extern "C" {
    pub fn wctob(__c: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbsinit(__ps: *const mbstate_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbrtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
        __p: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcrtomb(__s: *mut ::std::os::raw::c_char, __wc: wchar_t, __ps: *mut mbstate_t) -> usize;
}
extern "C" {
    pub fn __mbrlen(__s: *const ::std::os::raw::c_char, __n: usize, __ps: *mut mbstate_t) -> usize;
}
extern "C" {
    pub fn mbrlen(__s: *const ::std::os::raw::c_char, __n: usize, __ps: *mut mbstate_t) -> usize;
}
extern "C" {
    pub fn mbsrtowcs(
        __dst: *mut wchar_t,
        __src: *mut *const ::std::os::raw::c_char,
        __len: usize,
        __ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcsrtombs(
        __dst: *mut ::std::os::raw::c_char,
        __src: *mut *const wchar_t,
        __len: usize,
        __ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn mbsnrtowcs(
        __dst: *mut wchar_t,
        __src: *mut *const ::std::os::raw::c_char,
        __nmc: usize,
        __len: usize,
        __ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcsnrtombs(
        __dst: *mut ::std::os::raw::c_char,
        __src: *mut *const wchar_t,
        __nwc: usize,
        __len: usize,
        __ps: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcstod(__nptr: *const wchar_t, __endptr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstof(__nptr: *const wchar_t, __endptr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn wcstold(__nptr: *const wchar_t, __endptr: *mut *mut wchar_t) -> u128;
}
extern "C" {
    pub fn wcstol(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn wcstoul(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn wcstoll(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn wcstoull(
        __nptr: *const wchar_t,
        __endptr: *mut *mut wchar_t,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn wcpcpy(__dest: *mut wchar_t, __src: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcpncpy(__dest: *mut wchar_t, __src: *const wchar_t, __n: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn open_wmemstream(__bufloc: *mut *mut wchar_t, __sizeloc: *mut usize) -> *mut __FILE;
}
extern "C" {
    pub fn fwide(__fp: *mut __FILE, __mode: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fwprintf(__stream: *mut __FILE, __format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wprintf(__format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn swprintf(
        __s: *mut wchar_t,
        __n: usize,
        __format: *const wchar_t,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfwprintf(
        __s: *mut __FILE,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vwprintf(__format: *const wchar_t, __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vswprintf(
        __s: *mut wchar_t,
        __n: usize,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fwscanf(__stream: *mut __FILE, __format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wscanf(__format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn swscanf(__s: *const wchar_t, __format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fwscanf"]
    pub fn fwscanf1(__stream: *mut __FILE, __format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_wscanf"]
    pub fn wscanf1(__format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_swscanf"]
    pub fn swscanf1(__s: *const wchar_t, __format: *const wchar_t, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfwscanf(
        __s: *mut __FILE,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vwscanf(__format: *const wchar_t, __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vswscanf(
        __s: *const wchar_t,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfwscanf"]
    pub fn vfwscanf1(
        __s: *mut __FILE,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vwscanf"]
    pub fn vwscanf1(__format: *const wchar_t, __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vswscanf"]
    pub fn vswscanf1(
        __s: *const wchar_t,
        __format: *const wchar_t,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetwc(__stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn getwc(__stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fputwc(__wc: wchar_t, __stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn putwc(__wc: wchar_t, __stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(__wc: wchar_t) -> wint_t;
}
extern "C" {
    pub fn fgetws(
        __ws: *mut wchar_t,
        __n: ::std::os::raw::c_int,
        __stream: *mut __FILE,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn fputws(__ws: *const wchar_t, __stream: *mut __FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetwc(__wc: wint_t, __stream: *mut __FILE) -> wint_t;
}
extern "C" {
    pub fn wcsftime(
        __s: *mut wchar_t,
        __maxsize: usize,
        __format: *const wchar_t,
        __tp: *const tm,
    ) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct winsize {
    pub ws_row: ::std::os::raw::c_ushort,
    pub ws_col: ::std::os::raw::c_ushort,
    pub ws_xpixel: ::std::os::raw::c_ushort,
    pub ws_ypixel: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_winsize() {
    assert_eq!(
        ::std::mem::size_of::<winsize>(),
        8usize,
        concat!("Size of: ", stringify!(winsize))
    );
    assert_eq!(
        ::std::mem::align_of::<winsize>(),
        2usize,
        concat!("Alignment of ", stringify!(winsize))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winsize>())).ws_row as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(winsize),
            "::",
            stringify!(ws_row)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winsize>())).ws_col as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(winsize),
            "::",
            stringify!(ws_col)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winsize>())).ws_xpixel as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(winsize),
            "::",
            stringify!(ws_xpixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<winsize>())).ws_ypixel as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(winsize),
            "::",
            stringify!(ws_ypixel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct termio {
    pub c_iflag: ::std::os::raw::c_ushort,
    pub c_oflag: ::std::os::raw::c_ushort,
    pub c_cflag: ::std::os::raw::c_ushort,
    pub c_lflag: ::std::os::raw::c_ushort,
    pub c_line: ::std::os::raw::c_uchar,
    pub c_cc: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_termio() {
    assert_eq!(
        ::std::mem::size_of::<termio>(),
        18usize,
        concat!("Size of: ", stringify!(termio))
    );
    assert_eq!(
        ::std::mem::align_of::<termio>(),
        2usize,
        concat!("Alignment of ", stringify!(termio))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termio>())).c_iflag as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(termio),
            "::",
            stringify!(c_iflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termio>())).c_oflag as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(termio),
            "::",
            stringify!(c_oflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termio>())).c_cflag as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(termio),
            "::",
            stringify!(c_cflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termio>())).c_lflag as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(termio),
            "::",
            stringify!(c_lflag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termio>())).c_line as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(termio),
            "::",
            stringify!(c_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<termio>())).c_cc as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(termio),
            "::",
            stringify!(c_cc)
        )
    );
}
extern "C" {
    pub fn ioctl(
        __fd: ::std::os::raw::c_int,
        __request: ::std::os::raw::c_ulong,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn err(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn errx(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn warn(arg1: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn warnx(arg1: *const ::std::os::raw::c_char, ...);
}
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type bitstr_t = ::std::os::raw::c_uchar;
extern "C" {
    pub fn vis(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strvis(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn stravis(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strnvis(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strvisx(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strunvis(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unvis(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strnunvis(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
    ) -> isize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibuf {
    pub entry: ibuf__bindgen_ty_1,
    pub buf: *mut u_char,
    pub size: usize,
    pub max: usize,
    pub wpos: usize,
    pub rpos: usize,
    pub fd: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibuf__bindgen_ty_1 {
    pub tqe_next: *mut ibuf,
    pub tqe_prev: *mut *mut ibuf,
}
#[test]
fn bindgen_test_layout_ibuf__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<ibuf__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(ibuf__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ibuf__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ibuf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf__bindgen_ty_1>())).tqe_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf__bindgen_ty_1>())).tqe_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_ibuf() {
    assert_eq!(
        ::std::mem::size_of::<ibuf>(),
        64usize,
        concat!("Size of: ", stringify!(ibuf))
    );
    assert_eq!(
        ::std::mem::align_of::<ibuf>(),
        8usize,
        concat!("Alignment of ", stringify!(ibuf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf>())).entry as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf),
            "::",
            stringify!(entry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf>())).buf as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(ibuf), "::", stringify!(buf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf>())).max as *const _ as usize },
        32usize,
        concat!("Offset of field: ", stringify!(ibuf), "::", stringify!(max))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf>())).wpos as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf),
            "::",
            stringify!(wpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf>())).rpos as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf),
            "::",
            stringify!(rpos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf>())).fd as *const _ as usize },
        56usize,
        concat!("Offset of field: ", stringify!(ibuf), "::", stringify!(fd))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msgbuf {
    pub bufs: msgbuf__bindgen_ty_1,
    pub queued: u32,
    pub fd: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msgbuf__bindgen_ty_1 {
    pub tqh_first: *mut ibuf,
    pub tqh_last: *mut *mut ibuf,
}
#[test]
fn bindgen_test_layout_msgbuf__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<msgbuf__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(msgbuf__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<msgbuf__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(msgbuf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msgbuf__bindgen_ty_1>())).tqh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msgbuf__bindgen_ty_1),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msgbuf__bindgen_ty_1>())).tqh_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msgbuf__bindgen_ty_1),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[test]
fn bindgen_test_layout_msgbuf() {
    assert_eq!(
        ::std::mem::size_of::<msgbuf>(),
        24usize,
        concat!("Size of: ", stringify!(msgbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<msgbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(msgbuf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msgbuf>())).bufs as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msgbuf),
            "::",
            stringify!(bufs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msgbuf>())).queued as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msgbuf),
            "::",
            stringify!(queued)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msgbuf>())).fd as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(msgbuf),
            "::",
            stringify!(fd)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibuf_read {
    pub buf: [u_char; 65535usize],
    pub rptr: *mut u_char,
    pub wpos: usize,
}
#[test]
fn bindgen_test_layout_ibuf_read() {
    assert_eq!(
        ::std::mem::size_of::<ibuf_read>(),
        65552usize,
        concat!("Size of: ", stringify!(ibuf_read))
    );
    assert_eq!(
        ::std::mem::align_of::<ibuf_read>(),
        8usize,
        concat!("Alignment of ", stringify!(ibuf_read))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf_read>())).buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf_read),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf_read>())).rptr as *const _ as usize },
        65536usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf_read),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ibuf_read>())).wpos as *const _ as usize },
        65544usize,
        concat!(
            "Offset of field: ",
            stringify!(ibuf_read),
            "::",
            stringify!(wpos)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imsg_fd {
    pub entry: imsg_fd__bindgen_ty_1,
    pub fd: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imsg_fd__bindgen_ty_1 {
    pub tqe_next: *mut imsg_fd,
    pub tqe_prev: *mut *mut imsg_fd,
}
#[test]
fn bindgen_test_layout_imsg_fd__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<imsg_fd__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(imsg_fd__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<imsg_fd__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(imsg_fd__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_fd__bindgen_ty_1>())).tqe_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_fd__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_fd__bindgen_ty_1>())).tqe_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_fd__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_imsg_fd() {
    assert_eq!(
        ::std::mem::size_of::<imsg_fd>(),
        24usize,
        concat!("Size of: ", stringify!(imsg_fd))
    );
    assert_eq!(
        ::std::mem::align_of::<imsg_fd>(),
        8usize,
        concat!("Alignment of ", stringify!(imsg_fd))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_fd>())).entry as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_fd),
            "::",
            stringify!(entry)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_fd>())).fd as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_fd),
            "::",
            stringify!(fd)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct imsgbuf {
    pub fds: imsgbuf__bindgen_ty_1,
    pub r: ibuf_read,
    pub w: msgbuf,
    pub fd: ::std::os::raw::c_int,
    pub pid: pid_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imsgbuf__bindgen_ty_1 {
    pub tqh_first: *mut imsg_fd,
    pub tqh_last: *mut *mut imsg_fd,
}
#[test]
fn bindgen_test_layout_imsgbuf__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<imsgbuf__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(imsgbuf__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<imsgbuf__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(imsgbuf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsgbuf__bindgen_ty_1>())).tqh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imsgbuf__bindgen_ty_1),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsgbuf__bindgen_ty_1>())).tqh_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imsgbuf__bindgen_ty_1),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[test]
fn bindgen_test_layout_imsgbuf() {
    assert_eq!(
        ::std::mem::size_of::<imsgbuf>(),
        65600usize,
        concat!("Size of: ", stringify!(imsgbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<imsgbuf>(),
        8usize,
        concat!("Alignment of ", stringify!(imsgbuf))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsgbuf>())).fds as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imsgbuf),
            "::",
            stringify!(fds)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsgbuf>())).r as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(imsgbuf),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsgbuf>())).w as *const _ as usize },
        65568usize,
        concat!(
            "Offset of field: ",
            stringify!(imsgbuf),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsgbuf>())).fd as *const _ as usize },
        65592usize,
        concat!(
            "Offset of field: ",
            stringify!(imsgbuf),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsgbuf>())).pid as *const _ as usize },
        65596usize,
        concat!(
            "Offset of field: ",
            stringify!(imsgbuf),
            "::",
            stringify!(pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imsg_hdr {
    pub type_: u32,
    pub len: u16,
    pub flags: u16,
    pub peerid: u32,
    pub pid: u32,
}
#[test]
fn bindgen_test_layout_imsg_hdr() {
    assert_eq!(
        ::std::mem::size_of::<imsg_hdr>(),
        16usize,
        concat!("Size of: ", stringify!(imsg_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<imsg_hdr>(),
        4usize,
        concat!("Alignment of ", stringify!(imsg_hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_hdr>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_hdr>())).len as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_hdr),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_hdr>())).flags as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_hdr),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_hdr>())).peerid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_hdr),
            "::",
            stringify!(peerid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg_hdr>())).pid as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg_hdr),
            "::",
            stringify!(pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imsg {
    pub hdr: imsg_hdr,
    pub fd: ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_imsg() {
    assert_eq!(
        ::std::mem::size_of::<imsg>(),
        32usize,
        concat!("Size of: ", stringify!(imsg))
    );
    assert_eq!(
        ::std::mem::align_of::<imsg>(),
        8usize,
        concat!("Alignment of ", stringify!(imsg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg>())).hdr as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(imsg), "::", stringify!(hdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg>())).fd as *const _ as usize },
        16usize,
        concat!("Offset of field: ", stringify!(imsg), "::", stringify!(fd))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imsg>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(imsg),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    pub fn ibuf_open(arg1: usize) -> *mut ibuf;
}
extern "C" {
    pub fn ibuf_dynamic(arg1: usize, arg2: usize) -> *mut ibuf;
}
extern "C" {
    pub fn ibuf_add(
        arg1: *mut ibuf,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ibuf_reserve(arg1: *mut ibuf, arg2: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ibuf_seek(arg1: *mut ibuf, arg2: usize, arg3: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn ibuf_size(arg1: *mut ibuf) -> usize;
}
extern "C" {
    pub fn ibuf_left(arg1: *mut ibuf) -> usize;
}
extern "C" {
    pub fn ibuf_close(arg1: *mut msgbuf, arg2: *mut ibuf);
}
extern "C" {
    pub fn ibuf_write(arg1: *mut msgbuf) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ibuf_free(arg1: *mut ibuf);
}
extern "C" {
    pub fn msgbuf_init(arg1: *mut msgbuf);
}
extern "C" {
    pub fn msgbuf_clear(arg1: *mut msgbuf);
}
extern "C" {
    pub fn msgbuf_write(arg1: *mut msgbuf) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn msgbuf_drain(arg1: *mut msgbuf, arg2: usize);
}
extern "C" {
    pub fn imsg_init(arg1: *mut imsgbuf, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn imsg_read(arg1: *mut imsgbuf) -> isize;
}
extern "C" {
    pub fn imsg_get(arg1: *mut imsgbuf, arg2: *mut imsg) -> isize;
}
extern "C" {
    pub fn imsg_compose(
        arg1: *mut imsgbuf,
        arg2: u32,
        arg3: u32,
        arg4: pid_t,
        arg5: ::std::os::raw::c_int,
        arg6: *const ::std::os::raw::c_void,
        arg7: u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn imsg_composev(
        arg1: *mut imsgbuf,
        arg2: u32,
        arg3: u32,
        arg4: pid_t,
        arg5: ::std::os::raw::c_int,
        arg6: *const iovec,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn imsg_create(
        arg1: *mut imsgbuf,
        arg2: u32,
        arg3: u32,
        arg4: pid_t,
        arg5: u16,
    ) -> *mut ibuf;
}
extern "C" {
    pub fn imsg_add(
        arg1: *mut ibuf,
        arg2: *const ::std::os::raw::c_void,
        arg3: u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn imsg_close(arg1: *mut imsgbuf, arg2: *mut ibuf);
}
extern "C" {
    pub fn imsg_free(arg1: *mut imsg);
}
extern "C" {
    pub fn imsg_flush(arg1: *mut imsgbuf) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn imsg_clear(arg1: *mut imsgbuf);
}
extern "C" {
    pub fn explicit_bzero(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn getdtablecount() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn closefrom(arg1: ::std::os::raw::c_int);
}
extern "C" {
    pub fn strcasestr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtonum(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: *mut *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strlcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strlcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> usize;
}
extern "C" {
    pub fn strndup(
        arg1: *const ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memmem(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
        arg3: *const ::std::os::raw::c_void,
        arg4: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn daemon(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getprogname() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn setproctitle(arg1: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn b64_ntop(
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
        arg3: *mut ::std::os::raw::c_char,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn b64_pton(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut u_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getptmfd() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdforkpty(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
        arg4: *mut termios,
        arg5: *mut winsize,
    ) -> pid_t;
}
extern "C" {
    pub fn forkpty(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *mut termios,
        arg4: *mut winsize,
    ) -> pid_t;
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fparseln(
        arg1: *mut FILE,
        arg2: *mut usize,
        arg3: *mut usize,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setenv(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn freezero(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn reallocarray(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn recallocarray(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}BSDopterr"]
    pub static mut BSDopterr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}BSDoptind"]
    pub static mut BSDoptind: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}BSDoptopt"]
    pub static mut BSDoptopt: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}BSDoptreset"]
    pub static mut BSDoptreset: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}BSDoptarg"]
    pub static mut BSDoptarg: *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn BSDgetopt(
        arg1: ::std::os::raw::c_int,
        arg2: *const *mut ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xmalloc(arg1: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn xcalloc(arg1: usize, arg2: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn xrealloc(arg1: *mut ::std::os::raw::c_void, arg2: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn xreallocarray(
        arg1: *mut ::std::os::raw::c_void,
        arg2: usize,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn xstrdup(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn xstrndup(
        arg1: *const ::std::os::raw::c_char,
        arg2: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn xasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xvasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xsnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn xvsnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}environ"]
    pub static mut environ: *mut *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct environ {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct format_job_tree {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct input_ctx {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct job {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mode_tree_data {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct options {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct options_entry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct options_array_item {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tmuxpeer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tmuxproc {
    _unused: [u8; 0],
}
pub type key_code = ::std::os::raw::c_ulonglong;
pub const KEYC_FOCUS_IN: _bindgen_ty_7 = 268435456;
pub const KEYC_FOCUS_OUT: _bindgen_ty_7 = 268435457;
pub const KEYC_ANY: _bindgen_ty_7 = 268435458;
pub const KEYC_PASTE_START: _bindgen_ty_7 = 268435459;
pub const KEYC_PASTE_END: _bindgen_ty_7 = 268435460;
pub const KEYC_MOUSE: _bindgen_ty_7 = 268435461;
pub const KEYC_DRAGGING: _bindgen_ty_7 = 268435462;
pub const KEYC_MOUSEMOVE_PANE: _bindgen_ty_7 = 268435463;
pub const KEYC_MOUSEMOVE_STATUS: _bindgen_ty_7 = 268435464;
pub const KEYC_MOUSEMOVE_STATUS_LEFT: _bindgen_ty_7 = 268435465;
pub const KEYC_MOUSEMOVE_STATUS_RIGHT: _bindgen_ty_7 = 268435466;
pub const KEYC_MOUSEMOVE_STATUS_DEFAULT: _bindgen_ty_7 = 268435467;
pub const KEYC_MOUSEMOVE_BORDER: _bindgen_ty_7 = 268435468;
pub const KEYC_MOUSEDOWN1_PANE: _bindgen_ty_7 = 268435469;
pub const KEYC_MOUSEDOWN1_STATUS: _bindgen_ty_7 = 268435470;
pub const KEYC_MOUSEDOWN1_STATUS_LEFT: _bindgen_ty_7 = 268435471;
pub const KEYC_MOUSEDOWN1_STATUS_RIGHT: _bindgen_ty_7 = 268435472;
pub const KEYC_MOUSEDOWN1_STATUS_DEFAULT: _bindgen_ty_7 = 268435473;
pub const KEYC_MOUSEDOWN1_BORDER: _bindgen_ty_7 = 268435474;
pub const KEYC_MOUSEDOWN2_PANE: _bindgen_ty_7 = 268435475;
pub const KEYC_MOUSEDOWN2_STATUS: _bindgen_ty_7 = 268435476;
pub const KEYC_MOUSEDOWN2_STATUS_LEFT: _bindgen_ty_7 = 268435477;
pub const KEYC_MOUSEDOWN2_STATUS_RIGHT: _bindgen_ty_7 = 268435478;
pub const KEYC_MOUSEDOWN2_STATUS_DEFAULT: _bindgen_ty_7 = 268435479;
pub const KEYC_MOUSEDOWN2_BORDER: _bindgen_ty_7 = 268435480;
pub const KEYC_MOUSEDOWN3_PANE: _bindgen_ty_7 = 268435481;
pub const KEYC_MOUSEDOWN3_STATUS: _bindgen_ty_7 = 268435482;
pub const KEYC_MOUSEDOWN3_STATUS_LEFT: _bindgen_ty_7 = 268435483;
pub const KEYC_MOUSEDOWN3_STATUS_RIGHT: _bindgen_ty_7 = 268435484;
pub const KEYC_MOUSEDOWN3_STATUS_DEFAULT: _bindgen_ty_7 = 268435485;
pub const KEYC_MOUSEDOWN3_BORDER: _bindgen_ty_7 = 268435486;
pub const KEYC_MOUSEUP1_PANE: _bindgen_ty_7 = 268435487;
pub const KEYC_MOUSEUP1_STATUS: _bindgen_ty_7 = 268435488;
pub const KEYC_MOUSEUP1_STATUS_LEFT: _bindgen_ty_7 = 268435489;
pub const KEYC_MOUSEUP1_STATUS_RIGHT: _bindgen_ty_7 = 268435490;
pub const KEYC_MOUSEUP1_STATUS_DEFAULT: _bindgen_ty_7 = 268435491;
pub const KEYC_MOUSEUP1_BORDER: _bindgen_ty_7 = 268435492;
pub const KEYC_MOUSEUP2_PANE: _bindgen_ty_7 = 268435493;
pub const KEYC_MOUSEUP2_STATUS: _bindgen_ty_7 = 268435494;
pub const KEYC_MOUSEUP2_STATUS_LEFT: _bindgen_ty_7 = 268435495;
pub const KEYC_MOUSEUP2_STATUS_RIGHT: _bindgen_ty_7 = 268435496;
pub const KEYC_MOUSEUP2_STATUS_DEFAULT: _bindgen_ty_7 = 268435497;
pub const KEYC_MOUSEUP2_BORDER: _bindgen_ty_7 = 268435498;
pub const KEYC_MOUSEUP3_PANE: _bindgen_ty_7 = 268435499;
pub const KEYC_MOUSEUP3_STATUS: _bindgen_ty_7 = 268435500;
pub const KEYC_MOUSEUP3_STATUS_LEFT: _bindgen_ty_7 = 268435501;
pub const KEYC_MOUSEUP3_STATUS_RIGHT: _bindgen_ty_7 = 268435502;
pub const KEYC_MOUSEUP3_STATUS_DEFAULT: _bindgen_ty_7 = 268435503;
pub const KEYC_MOUSEUP3_BORDER: _bindgen_ty_7 = 268435504;
pub const KEYC_MOUSEDRAG1_PANE: _bindgen_ty_7 = 268435505;
pub const KEYC_MOUSEDRAG1_STATUS: _bindgen_ty_7 = 268435506;
pub const KEYC_MOUSEDRAG1_STATUS_LEFT: _bindgen_ty_7 = 268435507;
pub const KEYC_MOUSEDRAG1_STATUS_RIGHT: _bindgen_ty_7 = 268435508;
pub const KEYC_MOUSEDRAG1_STATUS_DEFAULT: _bindgen_ty_7 = 268435509;
pub const KEYC_MOUSEDRAG1_BORDER: _bindgen_ty_7 = 268435510;
pub const KEYC_MOUSEDRAG2_PANE: _bindgen_ty_7 = 268435511;
pub const KEYC_MOUSEDRAG2_STATUS: _bindgen_ty_7 = 268435512;
pub const KEYC_MOUSEDRAG2_STATUS_LEFT: _bindgen_ty_7 = 268435513;
pub const KEYC_MOUSEDRAG2_STATUS_RIGHT: _bindgen_ty_7 = 268435514;
pub const KEYC_MOUSEDRAG2_STATUS_DEFAULT: _bindgen_ty_7 = 268435515;
pub const KEYC_MOUSEDRAG2_BORDER: _bindgen_ty_7 = 268435516;
pub const KEYC_MOUSEDRAG3_PANE: _bindgen_ty_7 = 268435517;
pub const KEYC_MOUSEDRAG3_STATUS: _bindgen_ty_7 = 268435518;
pub const KEYC_MOUSEDRAG3_STATUS_LEFT: _bindgen_ty_7 = 268435519;
pub const KEYC_MOUSEDRAG3_STATUS_RIGHT: _bindgen_ty_7 = 268435520;
pub const KEYC_MOUSEDRAG3_STATUS_DEFAULT: _bindgen_ty_7 = 268435521;
pub const KEYC_MOUSEDRAG3_BORDER: _bindgen_ty_7 = 268435522;
pub const KEYC_MOUSEDRAGEND1_PANE: _bindgen_ty_7 = 268435523;
pub const KEYC_MOUSEDRAGEND1_STATUS: _bindgen_ty_7 = 268435524;
pub const KEYC_MOUSEDRAGEND1_STATUS_LEFT: _bindgen_ty_7 = 268435525;
pub const KEYC_MOUSEDRAGEND1_STATUS_RIGHT: _bindgen_ty_7 = 268435526;
pub const KEYC_MOUSEDRAGEND1_STATUS_DEFAULT: _bindgen_ty_7 = 268435527;
pub const KEYC_MOUSEDRAGEND1_BORDER: _bindgen_ty_7 = 268435528;
pub const KEYC_MOUSEDRAGEND2_PANE: _bindgen_ty_7 = 268435529;
pub const KEYC_MOUSEDRAGEND2_STATUS: _bindgen_ty_7 = 268435530;
pub const KEYC_MOUSEDRAGEND2_STATUS_LEFT: _bindgen_ty_7 = 268435531;
pub const KEYC_MOUSEDRAGEND2_STATUS_RIGHT: _bindgen_ty_7 = 268435532;
pub const KEYC_MOUSEDRAGEND2_STATUS_DEFAULT: _bindgen_ty_7 = 268435533;
pub const KEYC_MOUSEDRAGEND2_BORDER: _bindgen_ty_7 = 268435534;
pub const KEYC_MOUSEDRAGEND3_PANE: _bindgen_ty_7 = 268435535;
pub const KEYC_MOUSEDRAGEND3_STATUS: _bindgen_ty_7 = 268435536;
pub const KEYC_MOUSEDRAGEND3_STATUS_LEFT: _bindgen_ty_7 = 268435537;
pub const KEYC_MOUSEDRAGEND3_STATUS_RIGHT: _bindgen_ty_7 = 268435538;
pub const KEYC_MOUSEDRAGEND3_STATUS_DEFAULT: _bindgen_ty_7 = 268435539;
pub const KEYC_MOUSEDRAGEND3_BORDER: _bindgen_ty_7 = 268435540;
pub const KEYC_WHEELUP_PANE: _bindgen_ty_7 = 268435541;
pub const KEYC_WHEELUP_STATUS: _bindgen_ty_7 = 268435542;
pub const KEYC_WHEELUP_STATUS_LEFT: _bindgen_ty_7 = 268435543;
pub const KEYC_WHEELUP_STATUS_RIGHT: _bindgen_ty_7 = 268435544;
pub const KEYC_WHEELUP_STATUS_DEFAULT: _bindgen_ty_7 = 268435545;
pub const KEYC_WHEELUP_BORDER: _bindgen_ty_7 = 268435546;
pub const KEYC_WHEELDOWN_PANE: _bindgen_ty_7 = 268435547;
pub const KEYC_WHEELDOWN_STATUS: _bindgen_ty_7 = 268435548;
pub const KEYC_WHEELDOWN_STATUS_LEFT: _bindgen_ty_7 = 268435549;
pub const KEYC_WHEELDOWN_STATUS_RIGHT: _bindgen_ty_7 = 268435550;
pub const KEYC_WHEELDOWN_STATUS_DEFAULT: _bindgen_ty_7 = 268435551;
pub const KEYC_WHEELDOWN_BORDER: _bindgen_ty_7 = 268435552;
pub const KEYC_DOUBLECLICK1_PANE: _bindgen_ty_7 = 268435553;
pub const KEYC_DOUBLECLICK1_STATUS: _bindgen_ty_7 = 268435554;
pub const KEYC_DOUBLECLICK1_STATUS_LEFT: _bindgen_ty_7 = 268435555;
pub const KEYC_DOUBLECLICK1_STATUS_RIGHT: _bindgen_ty_7 = 268435556;
pub const KEYC_DOUBLECLICK1_STATUS_DEFAULT: _bindgen_ty_7 = 268435557;
pub const KEYC_DOUBLECLICK1_BORDER: _bindgen_ty_7 = 268435558;
pub const KEYC_DOUBLECLICK2_PANE: _bindgen_ty_7 = 268435559;
pub const KEYC_DOUBLECLICK2_STATUS: _bindgen_ty_7 = 268435560;
pub const KEYC_DOUBLECLICK2_STATUS_LEFT: _bindgen_ty_7 = 268435561;
pub const KEYC_DOUBLECLICK2_STATUS_RIGHT: _bindgen_ty_7 = 268435562;
pub const KEYC_DOUBLECLICK2_STATUS_DEFAULT: _bindgen_ty_7 = 268435563;
pub const KEYC_DOUBLECLICK2_BORDER: _bindgen_ty_7 = 268435564;
pub const KEYC_DOUBLECLICK3_PANE: _bindgen_ty_7 = 268435565;
pub const KEYC_DOUBLECLICK3_STATUS: _bindgen_ty_7 = 268435566;
pub const KEYC_DOUBLECLICK3_STATUS_LEFT: _bindgen_ty_7 = 268435567;
pub const KEYC_DOUBLECLICK3_STATUS_RIGHT: _bindgen_ty_7 = 268435568;
pub const KEYC_DOUBLECLICK3_STATUS_DEFAULT: _bindgen_ty_7 = 268435569;
pub const KEYC_DOUBLECLICK3_BORDER: _bindgen_ty_7 = 268435570;
pub const KEYC_TRIPLECLICK1_PANE: _bindgen_ty_7 = 268435571;
pub const KEYC_TRIPLECLICK1_STATUS: _bindgen_ty_7 = 268435572;
pub const KEYC_TRIPLECLICK1_STATUS_LEFT: _bindgen_ty_7 = 268435573;
pub const KEYC_TRIPLECLICK1_STATUS_RIGHT: _bindgen_ty_7 = 268435574;
pub const KEYC_TRIPLECLICK1_STATUS_DEFAULT: _bindgen_ty_7 = 268435575;
pub const KEYC_TRIPLECLICK1_BORDER: _bindgen_ty_7 = 268435576;
pub const KEYC_TRIPLECLICK2_PANE: _bindgen_ty_7 = 268435577;
pub const KEYC_TRIPLECLICK2_STATUS: _bindgen_ty_7 = 268435578;
pub const KEYC_TRIPLECLICK2_STATUS_LEFT: _bindgen_ty_7 = 268435579;
pub const KEYC_TRIPLECLICK2_STATUS_RIGHT: _bindgen_ty_7 = 268435580;
pub const KEYC_TRIPLECLICK2_STATUS_DEFAULT: _bindgen_ty_7 = 268435581;
pub const KEYC_TRIPLECLICK2_BORDER: _bindgen_ty_7 = 268435582;
pub const KEYC_TRIPLECLICK3_PANE: _bindgen_ty_7 = 268435583;
pub const KEYC_TRIPLECLICK3_STATUS: _bindgen_ty_7 = 268435584;
pub const KEYC_TRIPLECLICK3_STATUS_LEFT: _bindgen_ty_7 = 268435585;
pub const KEYC_TRIPLECLICK3_STATUS_RIGHT: _bindgen_ty_7 = 268435586;
pub const KEYC_TRIPLECLICK3_STATUS_DEFAULT: _bindgen_ty_7 = 268435587;
pub const KEYC_TRIPLECLICK3_BORDER: _bindgen_ty_7 = 268435588;
pub const KEYC_BSPACE: _bindgen_ty_7 = 268435589;
pub const KEYC_F1: _bindgen_ty_7 = 268435590;
pub const KEYC_F2: _bindgen_ty_7 = 268435591;
pub const KEYC_F3: _bindgen_ty_7 = 268435592;
pub const KEYC_F4: _bindgen_ty_7 = 268435593;
pub const KEYC_F5: _bindgen_ty_7 = 268435594;
pub const KEYC_F6: _bindgen_ty_7 = 268435595;
pub const KEYC_F7: _bindgen_ty_7 = 268435596;
pub const KEYC_F8: _bindgen_ty_7 = 268435597;
pub const KEYC_F9: _bindgen_ty_7 = 268435598;
pub const KEYC_F10: _bindgen_ty_7 = 268435599;
pub const KEYC_F11: _bindgen_ty_7 = 268435600;
pub const KEYC_F12: _bindgen_ty_7 = 268435601;
pub const KEYC_IC: _bindgen_ty_7 = 268435602;
pub const KEYC_DC: _bindgen_ty_7 = 268435603;
pub const KEYC_HOME: _bindgen_ty_7 = 268435604;
pub const KEYC_END: _bindgen_ty_7 = 268435605;
pub const KEYC_NPAGE: _bindgen_ty_7 = 268435606;
pub const KEYC_PPAGE: _bindgen_ty_7 = 268435607;
pub const KEYC_BTAB: _bindgen_ty_7 = 268435608;
pub const KEYC_UP: _bindgen_ty_7 = 268435609;
pub const KEYC_DOWN: _bindgen_ty_7 = 268435610;
pub const KEYC_LEFT: _bindgen_ty_7 = 268435611;
pub const KEYC_RIGHT: _bindgen_ty_7 = 268435612;
pub const KEYC_KP_SLASH: _bindgen_ty_7 = 268435613;
pub const KEYC_KP_STAR: _bindgen_ty_7 = 268435614;
pub const KEYC_KP_MINUS: _bindgen_ty_7 = 268435615;
pub const KEYC_KP_SEVEN: _bindgen_ty_7 = 268435616;
pub const KEYC_KP_EIGHT: _bindgen_ty_7 = 268435617;
pub const KEYC_KP_NINE: _bindgen_ty_7 = 268435618;
pub const KEYC_KP_PLUS: _bindgen_ty_7 = 268435619;
pub const KEYC_KP_FOUR: _bindgen_ty_7 = 268435620;
pub const KEYC_KP_FIVE: _bindgen_ty_7 = 268435621;
pub const KEYC_KP_SIX: _bindgen_ty_7 = 268435622;
pub const KEYC_KP_ONE: _bindgen_ty_7 = 268435623;
pub const KEYC_KP_TWO: _bindgen_ty_7 = 268435624;
pub const KEYC_KP_THREE: _bindgen_ty_7 = 268435625;
pub const KEYC_KP_ENTER: _bindgen_ty_7 = 268435626;
pub const KEYC_KP_ZERO: _bindgen_ty_7 = 268435627;
pub const KEYC_KP_PERIOD: _bindgen_ty_7 = 268435628;
pub type _bindgen_ty_7 = u32;
pub const tty_code_code_TTYC_ACSC: tty_code_code = 0;
pub const tty_code_code_TTYC_AX: tty_code_code = 1;
pub const tty_code_code_TTYC_BCE: tty_code_code = 2;
pub const tty_code_code_TTYC_BEL: tty_code_code = 3;
pub const tty_code_code_TTYC_BLINK: tty_code_code = 4;
pub const tty_code_code_TTYC_BOLD: tty_code_code = 5;
pub const tty_code_code_TTYC_CIVIS: tty_code_code = 6;
pub const tty_code_code_TTYC_CLEAR: tty_code_code = 7;
pub const tty_code_code_TTYC_CNORM: tty_code_code = 8;
pub const tty_code_code_TTYC_COLORS: tty_code_code = 9;
pub const tty_code_code_TTYC_CR: tty_code_code = 10;
pub const tty_code_code_TTYC_CS: tty_code_code = 11;
pub const tty_code_code_TTYC_CSR: tty_code_code = 12;
pub const tty_code_code_TTYC_CUB: tty_code_code = 13;
pub const tty_code_code_TTYC_CUB1: tty_code_code = 14;
pub const tty_code_code_TTYC_CUD: tty_code_code = 15;
pub const tty_code_code_TTYC_CUD1: tty_code_code = 16;
pub const tty_code_code_TTYC_CUF: tty_code_code = 17;
pub const tty_code_code_TTYC_CUF1: tty_code_code = 18;
pub const tty_code_code_TTYC_CUP: tty_code_code = 19;
pub const tty_code_code_TTYC_CUU: tty_code_code = 20;
pub const tty_code_code_TTYC_CUU1: tty_code_code = 21;
pub const tty_code_code_TTYC_CVVIS: tty_code_code = 22;
pub const tty_code_code_TTYC_DCH: tty_code_code = 23;
pub const tty_code_code_TTYC_DCH1: tty_code_code = 24;
pub const tty_code_code_TTYC_DIM: tty_code_code = 25;
pub const tty_code_code_TTYC_DL: tty_code_code = 26;
pub const tty_code_code_TTYC_DL1: tty_code_code = 27;
pub const tty_code_code_TTYC_E3: tty_code_code = 28;
pub const tty_code_code_TTYC_ECH: tty_code_code = 29;
pub const tty_code_code_TTYC_ED: tty_code_code = 30;
pub const tty_code_code_TTYC_EL: tty_code_code = 31;
pub const tty_code_code_TTYC_EL1: tty_code_code = 32;
pub const tty_code_code_TTYC_ENACS: tty_code_code = 33;
pub const tty_code_code_TTYC_FSL: tty_code_code = 34;
pub const tty_code_code_TTYC_HOME: tty_code_code = 35;
pub const tty_code_code_TTYC_HPA: tty_code_code = 36;
pub const tty_code_code_TTYC_ICH: tty_code_code = 37;
pub const tty_code_code_TTYC_ICH1: tty_code_code = 38;
pub const tty_code_code_TTYC_IL: tty_code_code = 39;
pub const tty_code_code_TTYC_IL1: tty_code_code = 40;
pub const tty_code_code_TTYC_INDN: tty_code_code = 41;
pub const tty_code_code_TTYC_INVIS: tty_code_code = 42;
pub const tty_code_code_TTYC_KCBT: tty_code_code = 43;
pub const tty_code_code_TTYC_KCUB1: tty_code_code = 44;
pub const tty_code_code_TTYC_KCUD1: tty_code_code = 45;
pub const tty_code_code_TTYC_KCUF1: tty_code_code = 46;
pub const tty_code_code_TTYC_KCUU1: tty_code_code = 47;
pub const tty_code_code_TTYC_KDC2: tty_code_code = 48;
pub const tty_code_code_TTYC_KDC3: tty_code_code = 49;
pub const tty_code_code_TTYC_KDC4: tty_code_code = 50;
pub const tty_code_code_TTYC_KDC5: tty_code_code = 51;
pub const tty_code_code_TTYC_KDC6: tty_code_code = 52;
pub const tty_code_code_TTYC_KDC7: tty_code_code = 53;
pub const tty_code_code_TTYC_KDCH1: tty_code_code = 54;
pub const tty_code_code_TTYC_KDN2: tty_code_code = 55;
pub const tty_code_code_TTYC_KDN3: tty_code_code = 56;
pub const tty_code_code_TTYC_KDN4: tty_code_code = 57;
pub const tty_code_code_TTYC_KDN5: tty_code_code = 58;
pub const tty_code_code_TTYC_KDN6: tty_code_code = 59;
pub const tty_code_code_TTYC_KDN7: tty_code_code = 60;
pub const tty_code_code_TTYC_KEND: tty_code_code = 61;
pub const tty_code_code_TTYC_KEND2: tty_code_code = 62;
pub const tty_code_code_TTYC_KEND3: tty_code_code = 63;
pub const tty_code_code_TTYC_KEND4: tty_code_code = 64;
pub const tty_code_code_TTYC_KEND5: tty_code_code = 65;
pub const tty_code_code_TTYC_KEND6: tty_code_code = 66;
pub const tty_code_code_TTYC_KEND7: tty_code_code = 67;
pub const tty_code_code_TTYC_KF1: tty_code_code = 68;
pub const tty_code_code_TTYC_KF10: tty_code_code = 69;
pub const tty_code_code_TTYC_KF11: tty_code_code = 70;
pub const tty_code_code_TTYC_KF12: tty_code_code = 71;
pub const tty_code_code_TTYC_KF13: tty_code_code = 72;
pub const tty_code_code_TTYC_KF14: tty_code_code = 73;
pub const tty_code_code_TTYC_KF15: tty_code_code = 74;
pub const tty_code_code_TTYC_KF16: tty_code_code = 75;
pub const tty_code_code_TTYC_KF17: tty_code_code = 76;
pub const tty_code_code_TTYC_KF18: tty_code_code = 77;
pub const tty_code_code_TTYC_KF19: tty_code_code = 78;
pub const tty_code_code_TTYC_KF2: tty_code_code = 79;
pub const tty_code_code_TTYC_KF20: tty_code_code = 80;
pub const tty_code_code_TTYC_KF21: tty_code_code = 81;
pub const tty_code_code_TTYC_KF22: tty_code_code = 82;
pub const tty_code_code_TTYC_KF23: tty_code_code = 83;
pub const tty_code_code_TTYC_KF24: tty_code_code = 84;
pub const tty_code_code_TTYC_KF25: tty_code_code = 85;
pub const tty_code_code_TTYC_KF26: tty_code_code = 86;
pub const tty_code_code_TTYC_KF27: tty_code_code = 87;
pub const tty_code_code_TTYC_KF28: tty_code_code = 88;
pub const tty_code_code_TTYC_KF29: tty_code_code = 89;
pub const tty_code_code_TTYC_KF3: tty_code_code = 90;
pub const tty_code_code_TTYC_KF30: tty_code_code = 91;
pub const tty_code_code_TTYC_KF31: tty_code_code = 92;
pub const tty_code_code_TTYC_KF32: tty_code_code = 93;
pub const tty_code_code_TTYC_KF33: tty_code_code = 94;
pub const tty_code_code_TTYC_KF34: tty_code_code = 95;
pub const tty_code_code_TTYC_KF35: tty_code_code = 96;
pub const tty_code_code_TTYC_KF36: tty_code_code = 97;
pub const tty_code_code_TTYC_KF37: tty_code_code = 98;
pub const tty_code_code_TTYC_KF38: tty_code_code = 99;
pub const tty_code_code_TTYC_KF39: tty_code_code = 100;
pub const tty_code_code_TTYC_KF4: tty_code_code = 101;
pub const tty_code_code_TTYC_KF40: tty_code_code = 102;
pub const tty_code_code_TTYC_KF41: tty_code_code = 103;
pub const tty_code_code_TTYC_KF42: tty_code_code = 104;
pub const tty_code_code_TTYC_KF43: tty_code_code = 105;
pub const tty_code_code_TTYC_KF44: tty_code_code = 106;
pub const tty_code_code_TTYC_KF45: tty_code_code = 107;
pub const tty_code_code_TTYC_KF46: tty_code_code = 108;
pub const tty_code_code_TTYC_KF47: tty_code_code = 109;
pub const tty_code_code_TTYC_KF48: tty_code_code = 110;
pub const tty_code_code_TTYC_KF49: tty_code_code = 111;
pub const tty_code_code_TTYC_KF5: tty_code_code = 112;
pub const tty_code_code_TTYC_KF50: tty_code_code = 113;
pub const tty_code_code_TTYC_KF51: tty_code_code = 114;
pub const tty_code_code_TTYC_KF52: tty_code_code = 115;
pub const tty_code_code_TTYC_KF53: tty_code_code = 116;
pub const tty_code_code_TTYC_KF54: tty_code_code = 117;
pub const tty_code_code_TTYC_KF55: tty_code_code = 118;
pub const tty_code_code_TTYC_KF56: tty_code_code = 119;
pub const tty_code_code_TTYC_KF57: tty_code_code = 120;
pub const tty_code_code_TTYC_KF58: tty_code_code = 121;
pub const tty_code_code_TTYC_KF59: tty_code_code = 122;
pub const tty_code_code_TTYC_KF6: tty_code_code = 123;
pub const tty_code_code_TTYC_KF60: tty_code_code = 124;
pub const tty_code_code_TTYC_KF61: tty_code_code = 125;
pub const tty_code_code_TTYC_KF62: tty_code_code = 126;
pub const tty_code_code_TTYC_KF63: tty_code_code = 127;
pub const tty_code_code_TTYC_KF7: tty_code_code = 128;
pub const tty_code_code_TTYC_KF8: tty_code_code = 129;
pub const tty_code_code_TTYC_KF9: tty_code_code = 130;
pub const tty_code_code_TTYC_KHOM2: tty_code_code = 131;
pub const tty_code_code_TTYC_KHOM3: tty_code_code = 132;
pub const tty_code_code_TTYC_KHOM4: tty_code_code = 133;
pub const tty_code_code_TTYC_KHOM5: tty_code_code = 134;
pub const tty_code_code_TTYC_KHOM6: tty_code_code = 135;
pub const tty_code_code_TTYC_KHOM7: tty_code_code = 136;
pub const tty_code_code_TTYC_KHOME: tty_code_code = 137;
pub const tty_code_code_TTYC_KIC2: tty_code_code = 138;
pub const tty_code_code_TTYC_KIC3: tty_code_code = 139;
pub const tty_code_code_TTYC_KIC4: tty_code_code = 140;
pub const tty_code_code_TTYC_KIC5: tty_code_code = 141;
pub const tty_code_code_TTYC_KIC6: tty_code_code = 142;
pub const tty_code_code_TTYC_KIC7: tty_code_code = 143;
pub const tty_code_code_TTYC_KICH1: tty_code_code = 144;
pub const tty_code_code_TTYC_KIND: tty_code_code = 145;
pub const tty_code_code_TTYC_KLFT2: tty_code_code = 146;
pub const tty_code_code_TTYC_KLFT3: tty_code_code = 147;
pub const tty_code_code_TTYC_KLFT4: tty_code_code = 148;
pub const tty_code_code_TTYC_KLFT5: tty_code_code = 149;
pub const tty_code_code_TTYC_KLFT6: tty_code_code = 150;
pub const tty_code_code_TTYC_KLFT7: tty_code_code = 151;
pub const tty_code_code_TTYC_KMOUS: tty_code_code = 152;
pub const tty_code_code_TTYC_KNP: tty_code_code = 153;
pub const tty_code_code_TTYC_KNXT2: tty_code_code = 154;
pub const tty_code_code_TTYC_KNXT3: tty_code_code = 155;
pub const tty_code_code_TTYC_KNXT4: tty_code_code = 156;
pub const tty_code_code_TTYC_KNXT5: tty_code_code = 157;
pub const tty_code_code_TTYC_KNXT6: tty_code_code = 158;
pub const tty_code_code_TTYC_KNXT7: tty_code_code = 159;
pub const tty_code_code_TTYC_KPP: tty_code_code = 160;
pub const tty_code_code_TTYC_KPRV2: tty_code_code = 161;
pub const tty_code_code_TTYC_KPRV3: tty_code_code = 162;
pub const tty_code_code_TTYC_KPRV4: tty_code_code = 163;
pub const tty_code_code_TTYC_KPRV5: tty_code_code = 164;
pub const tty_code_code_TTYC_KPRV6: tty_code_code = 165;
pub const tty_code_code_TTYC_KPRV7: tty_code_code = 166;
pub const tty_code_code_TTYC_KRI: tty_code_code = 167;
pub const tty_code_code_TTYC_KRIT2: tty_code_code = 168;
pub const tty_code_code_TTYC_KRIT3: tty_code_code = 169;
pub const tty_code_code_TTYC_KRIT4: tty_code_code = 170;
pub const tty_code_code_TTYC_KRIT5: tty_code_code = 171;
pub const tty_code_code_TTYC_KRIT6: tty_code_code = 172;
pub const tty_code_code_TTYC_KRIT7: tty_code_code = 173;
pub const tty_code_code_TTYC_KUP2: tty_code_code = 174;
pub const tty_code_code_TTYC_KUP3: tty_code_code = 175;
pub const tty_code_code_TTYC_KUP4: tty_code_code = 176;
pub const tty_code_code_TTYC_KUP5: tty_code_code = 177;
pub const tty_code_code_TTYC_KUP6: tty_code_code = 178;
pub const tty_code_code_TTYC_KUP7: tty_code_code = 179;
pub const tty_code_code_TTYC_MS: tty_code_code = 180;
pub const tty_code_code_TTYC_OP: tty_code_code = 181;
pub const tty_code_code_TTYC_REV: tty_code_code = 182;
pub const tty_code_code_TTYC_RGB: tty_code_code = 183;
pub const tty_code_code_TTYC_RI: tty_code_code = 184;
pub const tty_code_code_TTYC_RMACS: tty_code_code = 185;
pub const tty_code_code_TTYC_RMCUP: tty_code_code = 186;
pub const tty_code_code_TTYC_RMKX: tty_code_code = 187;
pub const tty_code_code_TTYC_SE: tty_code_code = 188;
pub const tty_code_code_TTYC_SETAB: tty_code_code = 189;
pub const tty_code_code_TTYC_SETAF: tty_code_code = 190;
pub const tty_code_code_TTYC_SETRGBB: tty_code_code = 191;
pub const tty_code_code_TTYC_SETRGBF: tty_code_code = 192;
pub const tty_code_code_TTYC_SGR0: tty_code_code = 193;
pub const tty_code_code_TTYC_SITM: tty_code_code = 194;
pub const tty_code_code_TTYC_SMACS: tty_code_code = 195;
pub const tty_code_code_TTYC_SMCUP: tty_code_code = 196;
pub const tty_code_code_TTYC_SMKX: tty_code_code = 197;
pub const tty_code_code_TTYC_SMSO: tty_code_code = 198;
pub const tty_code_code_TTYC_SMULX: tty_code_code = 199;
pub const tty_code_code_TTYC_SMUL: tty_code_code = 200;
pub const tty_code_code_TTYC_SMXX: tty_code_code = 201;
pub const tty_code_code_TTYC_SS: tty_code_code = 202;
pub const tty_code_code_TTYC_TC: tty_code_code = 203;
pub const tty_code_code_TTYC_TSL: tty_code_code = 204;
pub const tty_code_code_TTYC_U8: tty_code_code = 205;
pub const tty_code_code_TTYC_VPA: tty_code_code = 206;
pub const tty_code_code_TTYC_XENL: tty_code_code = 207;
pub const tty_code_code_TTYC_XT: tty_code_code = 208;
pub type tty_code_code = u32;
pub const msgtype_MSG_VERSION: msgtype = 12;
pub const msgtype_MSG_IDENTIFY_FLAGS: msgtype = 100;
pub const msgtype_MSG_IDENTIFY_TERM: msgtype = 101;
pub const msgtype_MSG_IDENTIFY_TTYNAME: msgtype = 102;
pub const msgtype_MSG_IDENTIFY_OLDCWD: msgtype = 103;
pub const msgtype_MSG_IDENTIFY_STDIN: msgtype = 104;
pub const msgtype_MSG_IDENTIFY_ENVIRON: msgtype = 105;
pub const msgtype_MSG_IDENTIFY_DONE: msgtype = 106;
pub const msgtype_MSG_IDENTIFY_CLIENTPID: msgtype = 107;
pub const msgtype_MSG_IDENTIFY_CWD: msgtype = 108;
pub const msgtype_MSG_COMMAND: msgtype = 200;
pub const msgtype_MSG_DETACH: msgtype = 201;
pub const msgtype_MSG_DETACHKILL: msgtype = 202;
pub const msgtype_MSG_EXIT: msgtype = 203;
pub const msgtype_MSG_EXITED: msgtype = 204;
pub const msgtype_MSG_EXITING: msgtype = 205;
pub const msgtype_MSG_LOCK: msgtype = 206;
pub const msgtype_MSG_READY: msgtype = 207;
pub const msgtype_MSG_RESIZE: msgtype = 208;
pub const msgtype_MSG_SHELL: msgtype = 209;
pub const msgtype_MSG_SHUTDOWN: msgtype = 210;
pub const msgtype_MSG_STDERR: msgtype = 211;
pub const msgtype_MSG_STDIN: msgtype = 212;
pub const msgtype_MSG_STDOUT: msgtype = 213;
pub const msgtype_MSG_SUSPEND: msgtype = 214;
pub const msgtype_MSG_UNLOCK: msgtype = 215;
pub const msgtype_MSG_WAKEUP: msgtype = 216;
pub const msgtype_MSG_EXEC: msgtype = 217;
pub type msgtype = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msg_command_data {
    pub argc: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msg_command_data() {
    assert_eq!(
        ::std::mem::size_of::<msg_command_data>(),
        4usize,
        concat!("Size of: ", stringify!(msg_command_data))
    );
    assert_eq!(
        ::std::mem::align_of::<msg_command_data>(),
        4usize,
        concat!("Alignment of ", stringify!(msg_command_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_command_data>())).argc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_command_data),
            "::",
            stringify!(argc)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct msg_stdin_data {
    pub size: isize,
    pub data: [::std::os::raw::c_char; 8192usize],
}
#[test]
fn bindgen_test_layout_msg_stdin_data() {
    assert_eq!(
        ::std::mem::size_of::<msg_stdin_data>(),
        8200usize,
        concat!("Size of: ", stringify!(msg_stdin_data))
    );
    assert_eq!(
        ::std::mem::align_of::<msg_stdin_data>(),
        8usize,
        concat!("Alignment of ", stringify!(msg_stdin_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_stdin_data>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_stdin_data),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_stdin_data>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_stdin_data),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct msg_stdout_data {
    pub size: isize,
    pub data: [::std::os::raw::c_char; 8192usize],
}
#[test]
fn bindgen_test_layout_msg_stdout_data() {
    assert_eq!(
        ::std::mem::size_of::<msg_stdout_data>(),
        8200usize,
        concat!("Size of: ", stringify!(msg_stdout_data))
    );
    assert_eq!(
        ::std::mem::align_of::<msg_stdout_data>(),
        8usize,
        concat!("Alignment of ", stringify!(msg_stdout_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_stdout_data>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_stdout_data),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_stdout_data>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_stdout_data),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct msg_stderr_data {
    pub size: isize,
    pub data: [::std::os::raw::c_char; 8192usize],
}
#[test]
fn bindgen_test_layout_msg_stderr_data() {
    assert_eq!(
        ::std::mem::size_of::<msg_stderr_data>(),
        8200usize,
        concat!("Size of: ", stringify!(msg_stderr_data))
    );
    assert_eq!(
        ::std::mem::align_of::<msg_stderr_data>(),
        8usize,
        concat!("Alignment of ", stringify!(msg_stderr_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_stderr_data>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_stderr_data),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msg_stderr_data>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msg_stderr_data),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct utf8_data {
    pub data: [u_char; 18usize],
    pub have: u_char,
    pub size: u_char,
    pub width: u_char,
}
#[test]
fn bindgen_test_layout_utf8_data() {
    assert_eq!(
        ::std::mem::size_of::<utf8_data>(),
        21usize,
        concat!("Size of: ", stringify!(utf8_data))
    );
    assert_eq!(
        ::std::mem::align_of::<utf8_data>(),
        1usize,
        concat!("Alignment of ", stringify!(utf8_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<utf8_data>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(utf8_data),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<utf8_data>())).have as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(utf8_data),
            "::",
            stringify!(have)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<utf8_data>())).size as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(utf8_data),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<utf8_data>())).width as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(utf8_data),
            "::",
            stringify!(width)
        )
    );
}
pub const utf8_state_UTF8_MORE: utf8_state = 0;
pub const utf8_state_UTF8_DONE: utf8_state = 1;
pub const utf8_state_UTF8_ERROR: utf8_state = 2;
pub type utf8_state = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grid_cell {
    pub flags: u_char,
    pub attr: u_short,
    pub fg: ::std::os::raw::c_int,
    pub bg: ::std::os::raw::c_int,
    pub data: utf8_data,
}
#[test]
fn bindgen_test_layout_grid_cell() {
    assert_eq!(
        ::std::mem::size_of::<grid_cell>(),
        36usize,
        concat!("Size of: ", stringify!(grid_cell))
    );
    assert_eq!(
        ::std::mem::align_of::<grid_cell>(),
        4usize,
        concat!("Alignment of ", stringify!(grid_cell))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grid_cell>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(grid_cell),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grid_cell>())).attr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(grid_cell),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grid_cell>())).fg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(grid_cell),
            "::",
            stringify!(fg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grid_cell>())).bg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(grid_cell),
            "::",
            stringify!(bg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<grid_cell>())).data as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(grid_cell),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct grid_cell_entry {
    pub flags: u_char,
    pub __bindgen_anon_1: grid_cell_entry__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union grid_cell_entry__bindgen_ty_1 {
    pub offset: u_int,
    pub data: grid_cell_entry__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct grid_cell_entry__bindgen_ty_1__bindgen_ty_1 {
    pub attr: u_char,
    pub fg: u_char,
    pub bg: u_char,
    pub data: u_char,
}
#[test]
fn bindgen_test_layout_grid_cell_entry__bindgen_ty_1__bindgen_ty_1() {
